[["Class attendance.", "Can I join 7:30 am class?", "Even though my session is 6:30pm?"], ["PONs and AONs.", "In chapter 1.2.1, it says that \"In the PON architecture, all packets sent from OLT to the splitter are replicated at the splitter.\"", "Does this means that PON is a shared network system like the cable Internet access?If it is so, then is AON a Switched Netwrok, and the OLT is acting as a switch for the different ONTs?"], ["Is there any Home work given?.", "Is there any home work given?I got this email from Rao, not sure what do ?Am I missing something?"], ["Question about virtual meeting link.", "I couldn't find the link to the meeting.", "When I click on these links, it didn't redirect me to the meeting, but I received message below.Also, the corresponding meeting links have incorrect date?", "I don't know how to join virtual session online."], ["I joined the class late and I cannot access the lectures on Den..", "It says I don't have permission to view the content.", "Can someone help?", "Thank you!"], ["Bytes vs.", "Bits.", "In problem P6.g the R is in units of 10 Mega bits per second, NOT 10 Mega bytes per second, correct?I can’t seem to find a definitive answer in the book.", "I believe the standard is capital B = bytes and lower case b = bits.Thanks!"], ["HW not visible on D2L.", "Hey guys,I'm not able to view my Homework under the homework tab on D2L.", "Does anyone know where I'm going wrong?Thanks."], ["dropbox folder for HW#1 upload.", "Hi everyone,Does anyone know where to find the dropbox folder/link for uploading HW#1?", "Thanks very much in advance."], ["HW1 P5.", "Hi, does anyone know what it means by \"suppose the caravan travels 175 km\"?", "Does it mean the distance from one tollbooth to another is 175 km?Thanks!"], ["Throughput.", "To calculate throughput, do we need to include T_ack?Today in class, throughput was defined as: rate at which data is delivered (to receiver) reliably measured in bps.I believe we said T_ack must used to determine this but that often it can be neglected.In the book in section 1.4.4 it defines instantaneous throughput and average throughput without mention of T_ack"], ["HW1 P21.", "Hi everyone,I am quite confused that the expressions in P21: \"maximum throughput that server can achieve\".", "Does it mean that we only need to focus on the link between sever and first router $$R_{1}^{k}$$ (kth path)or we have to consider the whole path's transmission rate(links of each path from server to client)?"], ["P12.", "Hi everyone,\n\nDoes anyone know what is the unit of the packet length L?", "Can I assume that it is in bytes?", "Thanks"], ["Study Group.", "Hello, I'm a grad student in Computer Science (Scientists & Engineers) and looking for a study group so that we can enhance each other.A bit myself, I have 10 years of working experience as a trader and love programming and surfing.", "I'm looking forward to hearing from someone!tkai@usc.edu"], ["Swap Discussion Time.", "Hi!I am trying to register for a different Spanish class on Friday, but my discussion on Friday from 11am-11:50am conflicts with it.", "I am trying to move into the discussion section on Friday from 1pm-1:50pm because the Wednesday discussion conflicts with my lab that day for a different class.", "If you can switch, I would really appreciate it!", "My email is fhill@usc.edu."], ["The definition of 1 Mbps.", "Hi everyone.", "I am wondering in the real case 1 Mbps = 1024*1024 bps, but in calculation could we use 1 Mbps = 1*10^6 bps to facilitate calculation?"], ["Utilities.", "I've heard the professor mention the 'utilities' a few times during lectures.", "I've looked for them on the course website but have so far not been able to locate them.", "Can someone please show me where they can be found?", "Thank you"], ["P28 Size Difference Between 50 terabyte and 20 * 40,000 bits.", "Hi Everyone, does anyone knows why in P28 b), the 50 terabytes of data in P24 is being divided into 20 40,000 bits of data?", "Is the data being compressed?Assuming 1T = 1,000,000,000,000, no matter if I convert the byte to bit or not, 20 * 40,000 can never reach 1T"], ["Lecture recording not available.", "Hi,I have been trying to watch the lecture recordings from Thursday, but I get this error.", "I think this is an error from the Panopto side, but is there a way we can watch the recordings?", "It's been like this for about a day."], ["P4: Can each switch have more than 4 hosts connected to it?.", "In figure 1.13 - can each switch have more than 4 hosts connected to it?", "I'm assuming it can have more, but because the figure only shows 4 per switch, I'm doubting if that is true."], ["HW1 - P25.", "Hello Guys,Can someone explain the meaning of width of a bit in the link?"], ["Should we convert bytes to bits?.", "Several of the questions give us the packet size as bytes (ex.", "1500 bytes).Since transmission rate is given in bits per second, we need to convert the packet size from bytes to bits to get the correct answer right?Thanks"], ["P7: Clarifying the starting point of the elapsed time.", "I'm a little uncertain about how to interpret the wording of the question in terms of where the elapsed time starts.How much time elapsesfrom the time a bit is created (from the original analog signal at Host A)until the bit is decoded (as part of the analog signal at Host B)?Does time start when the bit has just joined the digital stream, but has yet to be grouped into a packet?", "I think this delay would change depending on if it is the very first bit in the stream (and therefore first in the 56-byte packet), or if it is one of the last bits to fill the packet."], ["P25 Clarifying the Bandwidth-Delay Product.", "During the class, It said that RTT is more logical and should be used when calculating bandwidth-delay product.", "However, in P25, the question is asking for R * d_prop.", "Which one shall we use for further calculations in the question?"], ["P25(e).", "problem of definition of width.", "Hi everyone,In P25(e), after calculating the width of one bit, I have noticed that the result has nothing to do with link length(m).", "However, I am very confused that the \"width\" given in the problem is the definition in physical domain or in logical domain.", "In reality,  if the result is larger than link length m, I am wondering whether we have to get the one-digit result \" d == m\" due to the limitation of linked length (physical domain) or we just get the answer which is as same as the result smaller than link length m.(logical domain)"], ["Layered architecture slides.. Can anyone tell me where can I find the Layered architecture slides?", "I cannot find them on DEN site."], ["Lecture 1 Slides.", "I'm trying to find the PDF of the slides shown during lecture 1 which outline grading policies, how much each assignment/project is worth as a percentage, etc.", "I'm having difficulty finding that slide deck, is it available to us somewhere I'm not seeing?"], ["Traceroute.", "In the textbook, there's a section in chapter 1 that discusses how the Traceroute program works.", "It shows the following screenshot:The section explains that each row shows a a subsequent packet as it arrives at the next router.", "When the nth packet arrives at the nth router, it returns a message showing the round-trip delay for the packet.", "I expected the round-trip delay times to grow as the packet numbers increased, but they don't always increase.", "The textbook gives this explanation but I'm not understanding their message:Please explain?"], ["HW1 - P28.", "Do we need to count the propagation delay of the last (20th) acknowledge packet in the total time of sending the packet?"], ["Can I submit the HW again?.", "I've submitted my HW on website but after I reviewed my note I find some mistakes in HW to correct.", "Can I submit it again?", "Or it cannot be changed after submitting?"], ["HW1 - P5.", "For question 5, it supposes the caravan \"finishing just after a third tollbooth\".I am kind of confused about \"after a third tollbooth\".", "I assumed three situations, I am wondering which one I need to assume for this question?"], ["HW#1-P28.", "For part(a), what's the length of the data?", "Should I assume it's 40,000 bits * 20 ?For part(b), \"transimission time of an acknowledgement packet is negligible\" should I assume that both dtrans and dprop of acknowledgement are equal to 0?"], ["HW 1 - P25(d).", "I have found the width of a bit, but I do not know how to answer the football field question.", "How big is the football field?", "is it football or soccer?", "is it the length of the field or the width of the field?"], ["General Doubt.", "What are virtual circuits?Are they some type of packet-switched network ?"], ["Chinmay&#39;s today&#39;s OH timings.", "This note is just for today.Due to a sudden conflict with an academic activity, today, I will hold my office hours from 6pm to 8pm (instead of 2:30pm to 4:30pm).The zoom link and the location remains the same.Apologies for the inconvenience.Best,Chinmay"], ["Calculator for midterm and exams.", "For the midterm and the exam, can we use any model of Casio's and Texas Instruments' scientific calculator?", "I remembered that we cannot use graphic calculator during the exams, but forgets about the scientific calculators.Thanks"], ["Lab 2 commands.", "I wanted to try the second lab but I was not able to find the commands for Mac OS.I saw the lab has commands for windows which don't work on Mac and I also did not find any helpful results on the web.Can anyone help me out.", "I feel as I am missing something very obvious."], ["About HW2 submission.", "Where can I submit the HW2(which was assigned at Sept. 16)?I check the place where we submitted HW1, but I find that I cannot submit HW2 there by now."], ["DHCP&#39;s Destination IP address is my previous IP address even after release.", "Hello,I tried the lab 2 commands.", "The release worked fine and then I tried to obtain an IP address.", "The DHCP message looks as expected, but instead of broadcasting the message during OFFER and ACK, the server's destination address is my old IP address, even though it is 0.0.0.0 now (as can be seen in the screenshot).Can someone please explain how is the server still sending to the IP address 192.168.1.46 when my current IP address is 0.0.0.0?"], ["Is Lab2 the HW2?.", "Hello,Saw someone asked about HW2 submission, but I don't see where was the HW2 released.", "Is the Lab2 the HW2?"], ["Problems in Screenshooting Command Prompt.", "Dear Professor Zahid and TAs,After proceeding the process given by the document \"Lab1_MacOS_steps\", I have found that all the processes I have done do not based on the codes in command prompt.", "I am wondering how I can get the same results in command prompt as Windows laptops.", "If I cannot get the expected results in command prompt, do I need to take a screenshoot of command prompt?"], ["Homework #1 regrading.", "Hello everyone, I found that there is a correction mistake in HW1, I only know Grader's name but I don't know the mailbox.", "Is there any way to get Grader's mailbox and explain the situation?"], ["Missing HW1 grade.", "I am not able to view my HW1 grade on D2L."], ["About lab1 submission.", "Professor said that \"No report is required for lab1\" in the email.", "But if so, how can we submit our answers of the lab1 questions?"], ["Labs.", "Where do we access the labs?I keep seeing emails and piazza questions about labs but I have no clue what they are.All I see in D2L is homeworks.", "The labs section is empty for me.", "Are people referring to the utilities Professor Zahid has sent out?"], ["P28(a).", "In part (a), the question is asking how long it takes to send the file assuming the file is sent continuously.", "In reviewing the answer to this question, it is confusing.Why is propagation delay taken into consideration in this case?Isn't the file considered to be \"sent\" as soon as the sender puts the last bit of the file on the wire?"], ["dropbox folder for Lab2 report upload.", "Hello, does someone know where to upload lab2 report?", "I cannot find where to submit lab2 report."], ["Language issue.", "Hi dear Professor Zahid,Since my PC's language is Simplified Chinese, and it seems unable to change it to English, the content shown in Windows Command Prompt will be Chinese as well, is it okay to submit the screen shots with it?"], ["DHCP lab.", "Hi!", "I'm working on DHCP lab and I'm stuck at the first step.", "when I type ipconfig /release I get this result.", "I have tried a couple of solutions offered on the internet.", "I even connected to the internet via LAN but so far I couldn't resolve it.", "!", "[Screenshot_2022-09-20_235204.png](/redirect/s3?bucket=uploads&prefix=paste%2Fkcf04tlyzcx3bu%2Fe4d07d3e66b25170ea528787f076764f5655f77f3a467acf706d006afc3470e3%2Fimage.png)"], ["Couldn&#39;t Trigger/Trace DHCP Release Message.", "Hello,While being connected, I released current IP before renew DHCP lease but I couldn't trace the release action.", "Can someone explain this?", "Thank you!"], ["Two DHCP Discover.", "Hello,On m1 mac, my device sends out two \"DHCP discover\" when I renew IP from released status.", "How would you like me to draw the time datagram?", "Thanks!"], ["Lab 2.", "Hello,I am stuck at the first step.", "After disabling DHCP configuration, my IP address is supposed to be 0.0.0.0, but it shows that 10.25.160.229.", "Can anyone help with this?", "Thanks."], ["Problem in Representing Results.", "Dear Professor Zahid, TAs and Graders,After I completed the DHCP lab and tried to write my report, I noticed that in \"Hand In\" session, there was a statement \"when answering a question below, you shouldhand in a printout of the packet(s) within the trace that you used to answer the question asked.", "Annotate the printout to explain your answer.To print a packet, use File->Print, choose Selected packet only, choose Packet summary line, and select the minimum amount of packetdetail that you need to answer the question.\"", "Do we really need to use the print out PDF document to solve all 14 problems or we can use screenshots and paste screenshots below each questions?Honestly, the print-out PDF documents are not as vivid as screenshots."], ["Lab2 question 2.", "Hello,The instructions for submissions say \"The ReportMUSTbe Typed (Anything written by pen or pencil, points will be deducted).", "\"The question 2 for the lab asks us to draw a timing diagram.", "Is the diagram also required to be typed(like in the text) or can that be drawn on a paper?"], ["Reading assignment.", "Where can I exactly find the weekly reading assignments?", "I seem to get lost on D2L."], ["HW1.", "What is meant by Y.L.", "written during the grading of HW1?"], ["Lab2 Question.", "When i tried Lab2: release at the very beginning, after typing sudo ifconfig, I got a bunch of lines and I saw en0 with several ipv6 addresses but with no ipv4 addresses.", "I don’t know why, could anyone help me about that issue?"], ["Why DHCP offer and ack frames are broadcasted?.", "The client sends its MAC address to the server in the DHCP discover frame.", "Couldn't the server just use the client's MAC address as the destination for the DHCP offer and ack frames?"], ["Lab2 submission.", "Hi everyone，are our lab 2 assignments must be pdf？"], ["Having a hard time figuring out the commands for mac..", "I am having a hard time releasing the DHCP for my interface.", "I tried the commands that were given in the m1_mac document and the TA suggestions from @55 @71.", "But none seems to be working.Even after releasing the IP, I am still getting IPv4 and IPv6 and I do not see inet 0.0.0.0 anywhere.", "I tried 'sudo ifconfig en0 down' this makes my interface go inactive and I am not able to capture packets at all.", "Please give us clear guidelines for M1 mac.", "Would really appreciate your help."], ["Send One Packet Through a Link with N Paralles.", "Hi,If sending a packet in a link with N parallels, can this packet be split into N parts and send through each parallel?", "Or has to go through one parallel entirely?"], ["Persistence HTTP in Assignment.", "In the textbook question, if persistence HTTP is mentioned, should we always assume to use persistence HTTP with pipelining?Or should we provide calculation for persistence HTTP without pipelining as well?"], ["Why should IP broadcast implies MAC broadcast and vice versa?.", "So in @78, the instructor replied that because some clients can only accept the broadcast IP address before the whole DHCP process is done, the DHCP offer and ack messages have to be broadcasted.", "I understand that for this reason, we have to use the broadcast IP address as the destination for the DHCP offer and ack.", "My question is, couldn't we use a unicast MAC destination with a broadcast IP destination?", "This way other hosts on the network no longer need to process the DHCP packets.", "They can drop the messages as soon as they see the destination MAC doesn't match.Similarly, in ARP, the requester knows the IP but not the MAC.", "Can the requester use a broadcast MAC destination with a unicast IP address?", "This way other hosts on the network no longer need to process the ARP payload.", "They can drop the messages as soon as they see the destination IP doesn't match.", "I actually don't remember if it is indeed how ARP works.", "If not, why not?"], ["What is a self-learning switch ?.", "In section 6.7.1 at point 6, they have mentioned the use of a self-learning switch.Can someone please explain what they are and what makes them different from normal L2 switches?"], ["Question regarding the DHCP relay agent situation.", "Dear TAs and Professor,I have a question regarding the DHCP relay agent situation.For the IP underlying in the red, I understand that we need to let DHCP server know which network the DHCP Discover is created from.", "But it seems like in this diagram, it does not mention anything about the subnet mask.", "Professor said that by indicating the relay agent IP is 1.1.1.254, the DHCP server know the network address is 1.1.1.X.", "But can it not also be 1.1.X.X, or others?", "How can DHCP be so sure that network address part is 1.1.1.X.Thank you very much."], ["Lab 2: Received 2 ACK messages from different relay agents.", "My host received 2 ACK packets (10.26.0.2 and 10.26.0.3).", "Does that mean 2 relay agents both received my broadcast message？If this is the case, then why is there only 1 relay agent (10.26.0.2) giving me the Offer message?"], ["HW Q10 Tp?.", "Dear Professor, TAs, in chapter 2 Q10, since propagation velocity is not provided, should we assume it as the speed of light?", "Thank you."], ["Client ARP Probing on non DHCP assigned IP address.", "As I filters the ARP packet using Wireshark, My PC is probing two IP addresses.", "One is the IP address that is offered by the DHCP server.", "Another IP address my PC is probing is 169.254.19.180, which is a link_local address.", "Why does my computer requrest a link_local address?"], ["How does a host decide which DHCP Offer to acknowledge ?.", "In a scenario, where a host might receive, multiple DHCP OFFERs from different DHCP servers.How does the host decide which OFFER it will go with, as in which IP address it will raise the request for?Is there some specific algorithm executed by the network operating system to make this decision or simply whichever request was received first by the host will be given preference (first-come-first-server logic)?"], ["What is &#34;evaluation of the tool itself&#34; means in the Lab2 report requirement?.", "What is \"evaluation of the tool itself\" means in the Lab2 report requirement?"], ["Chapter 2 P10 - Is the persistent connection without paralleling?.", "Just want to verify that on Chapter 2 P10, the persistent connection is expected to be a single connection with pipelining?", "I seem to recall that it may be possible to open parallel persistent connections, but I don't see it in the book, so maybe I'm remembering that wrong.Also, as a follow up question, should we assume that the maximum amount of parallel non-persistent connections is 6?"], ["Offer and ACK Destination not the Same.", "The destination of the offer and ACK DHCP messages are the IP address that is offered to the client from the server and differ from the lab example, is this an acceptable difference?", "I followed the commands in the lab instructions but am unable to capture offer and ACK packets with the broadcast IP as the destination."], ["Ch6 - Q27 General Doubt.", "In the homework problem Chapter 6, Q.No 27, whenever L (size of packet) is mentioned, does that include the 5-byte header or while calculating packetization delay we should add 5 more bytes to the specified value of L?Like in part b, it is given L=1500, so does 1500 include the 5-byte header or we should add it bringing the total size of the packet to 1505 ?"], ["Lab 1 Due Time.", "Hello, I noticed the time that lab 1 is due is at 11:59am.", "Was this meant to be 11:59pm?", "I work during the day, is it possible for the due dates to all please be pm instead of am?", "Thank you"], ["Can&#39;t find Beej&#39;s tutorial on the website.", "Hi.", "Does anyone find the Beej's tutorial for socket and c/cpp?", "The professor mentioned on class, but I can't find where it is."], ["DHCP lab ipconfig commands.", "Hello, I’m stuck at the very first step with DHCP lab2.", "When I type ipconfig /release I get the result as below.", "It happens with both ethernet and wifi connection.", "How can I solve this problem?"], ["How does DHCP Server&#39;s ARP probe go to the other side of the relay agent?.", "When DHCP server offers the IP address, it will send ARP probe broadcast accross the data link layer, but the IP address is fixed.", "If the IP address that the DHCP server is looking for is at the other side of the relay agent, will the relay agent act as a Proxy ARP router and broadcast that ARP probe to the other network?", "If not, what is the process for the DHCP server to ARP probe the network connected by the relay agent?"], ["Midterm Dates.", "Hello!", "I noticed today that in my planner I have the midterm date written as next friday, but I could not find the information again to get the time.", "My discussion section is on Wednesday and I wanted to double check that the midterm will indeed be on friday?Please let us know where to find more information to prepare."], ["Midterm Dates.", "Hello!", "I noticed today that in my planner I have the midterm date written as next friday, but I could not find the information again to get the time.", "My discussion section is on Wednesday and I wanted to double check that the midterm will indeed be on friday?Please let us know where to find more information to prepare."], ["Wireshark Lab Details.", "In the email sent out about the lab, Professor mentioned that we need an abstract and conclusion.", "Are these separate sections we should add in addition to the lab write up answers?"], ["MIDTERM PAPERS.", "Can anyone share past year midterm papers if the have them?"], ["Code resuse.", "Are we allowed to use our \"own\" code from previous courses for the project?", "For example, previous work completed on our own in another USC course (i.e.", "CS455x).Are we allowed to use code that was provided in a previous USC course as part of the curriculum?", "For example, sample code, project templates, or header files (i.e.", "CS402).Thank you,"], ["Error checking.", "Will grading of the project submissions include rigorous testing of error cases?For example, will you be testing our project with invalid input files, names, passwords, etc.", "?"], ["Project Readme.", "Can you provide an example of the Readme file we should submit with our project?"], ["Throughput/Utilization.", "For midterm questions like 29 and 31 from the EE450-Sample-Problems, what should we assume for RTTs to establish the connection if it is not provided in the question?We have generally used 1 RTT in many of our problems.Thank you,"], ["What will happen if ACK frames are lost?.", "Assume the example in the lecture, the sequence number is 3 bits long, SWS is 7 and RWS is 1.", "The sender sent F0 to F6 and the receiver sent ACK7, which is lost.", "The sender didn't receive any ACK, so it keeps resending F0 to F6, while the receiver is expecting F7 and silently ignore all those F0 to F6, and then we are stuck here.", "How do we break out of the dead loop?", "Will the receiver resend the ACK7?"], ["Doubt regarding Sample Problems.", "In sample problem 1 there is no mention of length of link and data rate to calculate Tp.", "So do we ignore the Tp if such questions come in Mid Sem or we keep the term Tp as it is without solving it?"], ["Unit conversion.", "I was wondering if the unit conversion will be given in the exam.", "Or can we assume that file size units like MB or GB will use decimal conversion instead of binary conversion?", "For example, 1MB equals 10^6 instead of 220=1,048,576 bytes."], ["Question papers?.", "Was anybody able to find sample question papers?"], ["Mid term 1.", "Is today's lecture part of mid term 1?"], ["Sample problems, question 3.", "Problem 3 says:Here's my attempt at a solution for the first part:We’ll assume the speed of propagation if 2.5e8 for the first question.", "If the link can transmit at 10e9 bits per second, it can transmit one bit in 1/10e9 seconds.", "That’s 100e-12 seconds.", "In 100e-12 seconds, the bit can travel how far if it travels at 2.5e8 m/s ?", "100e-12 * 2.5e8 = 25e-3 meters or 25 mm long.For the second question in the problem, we're given the speed of propagation, but not the bandwidth.", "What bandwidth do we use for this problem, or is the bandwidth not needed?", "I'm not sure how to approach this without the bandwidth."], ["Sample Problem, Q1.", "Q1Below is my answers.", "To be honest, I'm not that confident since I couldn't figure out the definition of RTT in this case.", "Happy to get any comments.I assumed RTT = 1 x propagation delay in this case as handshaking takes 2 RTT.", "(a) Total time = 2RTT + Tp + Tt x 1500 = 1.44sec(b) Total time = 2RTT + (Tp + Tt + Tp) x 1500 = 241.36sec(c) 2RTT + 1500/20 x RTT = 6.16sec(d) up to 11RTT (1,2,4,...512,1024) happens.", "Thus, 2RTT + 11RTT = 1.04sec"], ["Messages.", "When a message needs to printed that includes the port number, with respect to whose port number should be printed?For example:After receiving the query information from the Main server, the client should print the following message:\"The client received the response from the Main server using TCP over port <port number>.", "\"Is this the well known port number of the Main Server or the dynamically allocated port number issued to the client?"], ["Q15 of sample problems.", "For #15 problem below, how can we know the sliding window protocol (SR or Go back N) used?", "I believe that to cover 312 packets as the BW*delay(RTT) product, SR will need 10 bits since the max window size is 2^(m-1) while Go back N only need 9 since it is 2^m - 1.", "Let me know if I am missing anything.___________Suppose you are designing a sliding window protocol for a 1-Mbps point-to-point link to the moon, which has a one-way latency of 1.25 seconds.", "Assuming that each frame carries 1 KB of data, what is the minimum number of bits you need for the sequence number?"], ["On campus midterm location.. Can anyone share the venue of midterm exam?", "It is not mentioned in the email.", "Will it be conducted in the OHE 122 classroom itself?"], ["Question about &#34;switches/node introduce delay&#34; in Q9, 10, sample problems.", "Hi Professor,In Q9 and Q10, the phrase \"node introduce delay\" has me a little bit perplexed.", "Does that imply that data will have an additional 10 bits added on after passing a node?", "Why is it described as a \"bit\" rather than a \"second\"?Looking forward to your reply."], ["sample problem 8b.", "What is this problem referring to when it says latency?"], ["11c.", "From my understanding, part c changes the problem to Selective Repeat and we are trying to figure out the minimum m?", "I thought m was a given in problems, I'm not sure how we are supposed to calculate it."], ["About SR ARQ acknowledgement.", "Hello everyone!", "I have a question about SR ARQ acks.Professor says that in SR ARQ, when the receiver receives a frame, it can either acknowledge it or not.", "If the receiver choose not to send the ack message, how can the sender knows that this frame has been received by the receiver and it does not need to send it again?"], ["Question regarding the throughput formula.", "Dear TAs and Professor,Should theTfcircled in red beframe lengthin bits, or am I misunderstanding the formula?Thank you very much."], ["Sample Question 9, part a.", "This problem states that packets have a 24 B header.", "Part a asks for what filesize is the total number of bytes sent across the network less for circuits than for packets.Wouldn't any filesize be less for circuits than for packets since circuits don't use headers?"], ["Sample question 10.", "For the first part of this question, wouldn't the circumference of the loop depend on the number of nodes?For example, if the ring had 2 nodes, the circumference would be different than if it has 20 nodes since some of the bytes would be in the process of being transferred from the node to the link."], ["Go-Back-N ARQ.", "Why does sender wait until timeout even after receiving duplicate ACKs?.", "Hello,This is concerning problem 3 in today's discussion session.Host A sends F1 and it is lost.", "In the meanwhile, Host A receives multiple ACK1 messages before Frame_1 times out.", "By receiving duplicate ACKs, the sender should know that Frame_1 was lost.", "But it decides to wait until timeout anyways until re-sending.", "Why is that the case?"], ["Queueing Delay on Midterm.", "Will Queueing Delay be on the midterm, like do we need to calculate it using L, R, and Lambda?", "Or will it be given to us?"], ["Stuffing.", "Why does frame synchronization fail if there are 7 consecutive ones?"], ["Bit stuffing separate question.", "Is bit stuffing only performed on the bits in the payload, or on the entire frame?"], ["Midterm 1 Review.", "Anyone want to study for the midterm tomorrow night?My email is rkumar81@usc.edu"], ["Cheatsheet content.", "Can I write on cheatsheet the FCS and bit stuffing (will these qualify as being equation)?"], ["Minimum number of bits.", "I can't find in the lectures anywhere on how to find the minimum number of bits required for the sequence numbers and how the RWS affects that.", "I know we can calculate the maximum number of frames that can be on the link at any given time and then calculate the number of bits required to represent that, but I get confused with the use of the word minimum and the different receiver window sizes."], ["Flag bits in error on receiving.", "Hello Professor and TAs,In the following frame structure, we provide Frame Check Sequence (FCS) only for the payload which we are providing in the Information part of the frame.", "Flag bits are in header and trailer are different which is 01111110.My question is: If the receives the one of theflag bits in error(either header or trailer), how will the data link layer react in this situation?For example, if the ending Flag has an error, the data link layer won't be able to detect he ending of the frame.", "This will lead to erroneously assuming starting flag of next upcoming frame as ending flag.", "And then this will lead to error in all upcoming frames."], ["Question about SR ARQ.", "We went over examples in class over SR ARQ with selective ACK but it was mentioned that this is optional.I was wondering how SR ARQ works without selective ACK?", "does the receiver do a cumulative ACK when all frames in the window are received?", "Does sender resend all frames in the window like in go-back-N in this case?"], ["Sample Problems.", "While checking my work I noticed that the book where these problems came from uses 1MB = 1024 KB.For the midterm are we ok to use the convention 1MB = 1000 KB?"], ["Problem 1 in 10/5 discussion.", "I have a question about problem 1 in yesterday’s discussion.", "(In A-B part)In the solution, P1 is calculated by transmitting 3 frames in 50msec from A.However, in my figure, I consider 50 comes from 2 Dprop + 1 Dtrans.PS: 2 Dprop : 1 from ACK and 1 from packet3.Although both of them are 50msec, I want to clarify my concept.Thank you for the support.Detail of timeline:At time 0: A start to send packet0.At time 10: Last bit of packet0 done at A, and start to send packet1 at A....At time 30, B received packet0, and send ACK0 to A.", "A send last bits of packet2.At time 50, A receive ACK0, so it can send packet3 to B.", "\"At time 80,B receive packet3.", "To avoid over flow, ACK2 from C should be earlier than this point. \""], ["Go back n or SR?.", "How can we determine if it is using Go back n or SR?"], ["Sample Problem Q17 (a).", "In Q17 (a),  the problem asked to draw timeline diagram for the case in which the frame is lost.", "It said \"Use timeout interval of about 2 RTT\"I am confused about the time when it should start to retransmit the frame 4.This is my timeline I had drawn for (a), but I'm not sure if I shouldstart counting the timeoutafter the sender finished sending frame 4 ?", "(if this is the case,  frame 4 would be re-transmitted at the end of the RTT2, showed in the below picture )or start counting from sending frame 1 ?", "(if this is the case,  frame 4 would be re-retransmitted at the end of RTT1 )or frame 4 will be re-transmittedright after the acceptance of the ACK5?", "(because the sender cannot send next frame until it receives at least 1 ack from previous 3 frames ?)"], ["Midterm ACK Transmission Time.", "A lot of the sample problems do not given us any information on whether or not ACK transmission time is negligible or not.", "Will the questions on the midterm specify whether or not the ACK transmission time should be considered?"], ["Socket programming commands on Midterm.", "I recall the professor saying in one of the lectures that he will be testing us on if we know the commands for creating and using a socket, is that true?"], ["SWS - Doubt.", "A point-to-point link over which a sliding window algorithm of SWS=5 frames is running.", "Each frame is 1 Kbits long.", "Tp=0.5s.The max bit rate over which the implementation can work and still keep the link fully utilized is ____?How to approach this question?"], ["Panopto server is down!.", "Is it just me or all the students who are facing this issue?Cannot view any Lecture/Discussion video.Screenshot_2022-10-06_at_4.04.43_PM.png"], ["Midterm Location.", "Where do we take midterm tomorrow?"], ["Scratch papers in midterm.", "Hi Prof. Zahid,Do we need to bringscratch paperson our own?", "Or you will provide us with it.Best wishes."], ["About format of midterm exam.", "I have a question that may seem a little bit silly.", "I wonder whether a Multiple Choice Question in the midterm exam will only have one correct answer or it may have several correct answers?"], ["About sockets based on UDP.", "Hello everyone!", "I cannot figure out the answer to the following question.", "Can someone help me?", "Thanks a lot in advance!", "(I think the answer may be \"d\" but I am not sure..."], ["Midterm session.", "Hi,I just to wanted to confirm this.I am an on-campus student registered in the evening session.So I'd have to take the exam at SGM123 from 7:00 ~ 9:10 PM.", "Is this correct?Thanks!"], ["Midterm Calculator Question.", "Are any calculators allowed (for example, a TI-89 graphing calculator)?", "If not, what \"tier\" of calculator is permitted (dumb, scientific, etc.", ")?"], ["Discussion Problem 3 Time-out.", "I may be missing something obvious here, but why does the timeout for F1 take 5 seconds to be resent if the timeout value is 4 seconds?", "The problem states that there are no processing delays and the writing the arrows as single lines encapsulates the Transmission delay, so I'm curious where that extra second comes from."], ["Definitions on cheat sheet?.", "Are only mathematical formulas allowed on cheatsheets or can we have things like definitions and diagrams?"], ["Shannon&#39;s Theorem and STDM formula.", "Dear TAs and Professor,Are Shannon's Theorem and STDM formula going to be in the midterm, although we did not really talk about it in the lecture, but only in discussion?", "Thank you very much."], ["Sample problem 33.", "Since 1% is used for synchronization, link utilization is 99%Assuming T-1 has 1.5MbpsSo I have calculated as 0.99 * 1.5 Mbps >= n* 110bps for first partn <= 13500Here are my answers:for TDMa)13500b) 4950c)1237d) 154e) 23for statistical TDM135000, 49500, 12375, 1546, 232Can someone help me verifying the answer?"], ["About the result’s expression.", "I’m wondering how many decimal places should be retained in the midterm?", "Is it okay to have 285.5 instead of 285.48761 when facing log thing?", "(Just for example)"], ["How is the bandwidth shared in a network?.", "Assume a local network, either switched or shared, hosts B and C want to send some packets to A.", "Who decides which of B and C goes first?", "In the case of a shared network, B wants to send bits to the link but C is already using the link at max capacity.", "How can B get its share of the link?", "In the case of a switched network, say A, B, and C are attached to a switch via 1Gbps links.", "B and C both want to send packets to A.", "How do they share the 1Gbps link between A and the switch?"], ["About Listen() and Accept() of TCP Server Socket.", "I am not sure if I am correct or not:Listen() creates and empty queue for a parent socket to hold incoming client connections.Accept() will be blocked until the queue is not empty.", "When the queue is not empty, Accept() gets a client connection from the head of the queue and creates a child socket, then connection is established.", "While a child socket is still alive, the parent socket is still listening (new connections can still queue) and Accept() can be called to create new child socket."], ["Issue with Q.2 in HW#2.. Hello, I was just going through the HW#2 solutions posted on DEN and saw that the number of packets considered in the solution is 800.", "In the Kurose book the number of packets considered was 100.", "Also, the length of packet is also different, in book it is 10^6 while in solution it is 8*10^6.", "Kindly compare the question and answer and make the necessary changes."], ["HW2 ch2 P10.", "Can anyone explain the solution of P10"], ["Sliding Window ARQ - Timeout before Transmitting Sending Window.", "In a Sliding Window algorithm, suppose a frame is transmitted and the timeout for this frame is such, that it expires before the complete sending window has been transmitted.Now the sender knows it has to resend a frame (and additionally, in case of a Go-Back-n, that the further frames will be rejected), would it go back and start retransmitting the timed-out frame or continue till it has completely transmitted its sending window and then revisit timed-out frames?"], ["Link Utilization.", "In the lecture for calculating the link utilization and throughput, the professor sent the number of frames in one window.", "I'm wondering how many frames we should send to calculate the max link utilization for each protocol.", "Specifically asking about question 25 on the sample problems."], ["Bandwidth x delay.", "do we use end-to-end delay or RTT when calculating the bandwidth-delay product here?"], ["hand-written-9-6.pdff.", "Reviewing lecture from 09/06 when we covered throughput, I am confused why the throughput is correct for this diagram:Assuming #1 and #2 are same length packets, why isn't throughput in this diagram = 2*Packet Length / (Transmission Time(packet) + RTT)?"], ["Metrics of the project?.", "Hi,May I ask for the evaluation metrics for each phase?", "How do I ensure I can get as many scores as possible?Thank you!"], ["Lab 3 - TCP Dropbox.", "Hi Professor Zahid,Could you please create the dropbox for TCP lab?", "Thank you."], ["Lab 3 - HTTP Post Is Out Of Order ?.", "In question 7 of TCP Lab, it asked:Consider the TCP segment containing the HTTP POST as the first segment in the TCP connection.", "What are the sequence numbers of the first six segments in the TCP connection (including the segment containing the HTTP POST)?It seems like that the HTTP Post packet should be captured before I uploaded any text file to the server.", "However, I didn't capture the HTTP post at the beginning.", "Instead, I captured the HTTP Post at the end of the uploading (when it's finished the uploading).This is a screenshot of \"tcp-ethereal-trace-1\", the packet trace file provided by the textbook.", "I use it for this lab.", "As you can see, there's no such HTTP post file at the beginning of the trace.At the end of the uploading process, it captured a HTTP post packetI'm very confused about the time when it captured the POST packet.", "Shouldn't the POST packet be captured right after we build TCP connection with the server?If that order is correct, how can I tell the RTT of the first 6 segments includingPOST packet as the first segment?"], ["TCP segments not acknowledged.", "some of my TCP segments are not acknowledged.", "What to do in that case for the lab question number 7?"], ["Can we use provided trace to answer lab3?.", "Is it acceptable to use provided tcp trace to answer lab3 questions except Q3 and Q14?"], ["IPv6 instead of IPv4.", "Hello,When I tried running wireshark for TCP on my own system, I am getting the IP addresses in IPv6 format instead of IPv4.", "Is there any way I can change the setting to IPv4?", "Else, should I provide the answer with IPv6, is that acceptable?"], ["Lab 3 repeated segment times.", "I'm trying to calculate the RTT for the first 6 segments, but found their sent time is the same (for 2-6).", "Does anyone know where I might have messed up here?", "They seem to each repeat 10-20 times"], ["Lab2 Grade.", "When should we expect to receive our scores for Lab 2?I would like to review Lab 2 score to ensure issues are repeated with submission of Lab 3. ;)"], ["Port number different for handshake and for actual transfer.", "Hello,I am getting different port numbers for the initial handshake (56414) vs during the actual HTTP information exchange (56355).", "Is this alright, and if so, how does the handshake carry forward to a different port number?In this situation, what should I mention my source port number as for Q3?"], ["Multiple TCP SYN segments.", "My wireshark captured two TCP SYN segments.", "One with port 54772 and other with port 54773.Can someone explain why this is happening?"], ["No FIN to disconnect TCP.", "I am trying to understand the TCP connections throughout the process.", "I followed the TCP stream and discovered there is no disconnecting process when we are done with data transfer (No FIN in the transmitted segments).", "Could someone help me understand this?", "Thanks!"], ["About lab2 and HW2 grade.", "When will we get our HW2 and lab2 scores?"], ["HW3.", "Has HW 3 been assigned yet?"], ["Lab3 value of alpha used for EstimatedRTT.", "For Q7 in Lab 3, should we use alpha = 0.125, or is there a specific value we should use?"], ["VM login password.", "It appears that the provided VM does not have a EE450 account (right now I can see CS103 Student User, CS104 Student User, and CS567 Student User).", "Which one should we pick and what would the password be?", "Thank you"], ["What is the RTT value for a TCP packet that receives a cumulative ACK?.", "I am working on Lab 3 Question 7.", "Say I have TCP segments with sequence number 1, 2, 3; sent at time = 1s, 2s, 3s, respectively.", "Then say they are all cumulatively ACKed with ACK4 at time = 4s.What is the RTT value for these sequence numbers?", "Is it 3s, 2s, 1s, respectively?", "That is, does the use of cumulative ACK mean that the RTT for earlier packets is higher?", "And if so, does this affect the estimated RTT calculation as well?", "Or do we ignore the ACKs for earlier packets when updating the estimated RTT?Thanks!"], ["How Do We Understand the Word &#34;Throttle&#34; in Question 9.", "Does \"throttle\" means that the sending speed becomes almost 0 or the sending speed becomes slower?It does become slower occasionally.", "I notice there are some segments (PSH, ACK) sent by the client that are smaller, but I do not think it is caused by flow-control, since the receive window is ample according to ACKs from the server."], ["What Does &#34;Every Other Received Segment&#34;  Refers to in Question 11.", "Does this refer to segments whose size is not the typical value sent by the sender?", "By the way, I did not find Table 3.2 on page 250 in the textbook.", "The only figure is Figure 3.39 TCP three-way handshake: segment exchange."], ["Dynamic Port Numbers.", "I am struggling with how to use getsockname().Within the project instructions it mentions that we should not hardcode TCP/UDP dynamic port numbers, and instead use getsockname() which takes a socket descriptor and a sockaddr struct.I created a sockaddr_in struct following code in Beej, and this struct has a sin_port port number field that is set to htons(3490) (from Beej example).", "This gives me a port number when I call the sin_port, but it also remains the same fixed value when I pass the sockaddr_in struct into getsockname() and call sin_port.", "If I don't set this sin_port field, I always get a port number of 0.Can anyone point me in the right direction?", "I am confused about how this can become dynamic if this sin_port field is required."], ["StudentVM crashing.", "Hi,My studentVM was working fine until yesterday, but when i tried to login today, it started crashing.Can anyone help me out how I can fix this?The Screenshot below is just after entering password.", "After this the whole screen turns black."], ["How do we define the first six segements in Q7?.", "Q7 mentions that the first 6 segments are defined as the first 6 segments after the TCP segment that contains HTTP POST.", "However, should we use the first 6 \"TCP segment of a reassembled PDU\" to calculate the RTT, or just simply the first segments after the segment contains the HTTP POST?", "Since there are some other segments that do not contain the file after the first segment.", "And when the segment needs retransmission how should we define the actual ACK time of the retransmitted segment and the segment sent between the retransmission?", "Thanks."], ["TCP Stream Graph Issue.", "I am having some issues generating the TCP Stream Graph for questions 13 and 14 of the lab.", "When I select a TCP segment that was sent and the select the select the menu : Statistics->TCP Stream Graph-> Time-SequenceGraph(Stevens), like specified in the directions I get a graph to load, but its for all the segments sent to my device from the server (not the other way around).", "Since Seq = 1 for all the ACKs from the server it just plots the data on a flat line.Did anyone else have this issue and know how to resolve?"], ["Postion of SYN ACK.", "Hi,I'm a bit confused by my tracking record.", "Did my machine start transmitting frames before SYN ACK?", "Why SYN ACK shows up at no.66 while SYN at no.38?"], ["TCP Slow Start.", "How do we identify when the slow start phase begins and ends from the Time-Sequence-Graph(Stevens)?"], ["Hand written notes.", "Handwritten notes of \" Lecture Video 10/06/2022 \" are not available on D2L.", "Would it be possible to post those notes now?"], ["EstimatedRTT Equation.", "Question 7 of Lab 2 repeatedly refers to page 242 for the EstimatedRTT equation, but there isn't an equation on that page.", "There is one on page 236 though, is this the correct equation we should be using?"], ["Lab 2 - Question 9.", "What is the minimum amount of available buffer space advertised at the received for the entire trace?I don't understand what question 9 is asking, what is available advertised buffer space?", "How do we find this information?"], ["Question with LAB3.", "Hello,I’m confused with my record during TCP lab.Is it normal to see this number of the length in the trace?I'm lost how can I match the ACKs with each segments in Q7."], ["Where to start for the project.", "I feel so overwhelmed by the spec, after reading.", "I do not know where is a starting point of the project.", "Can someone answer this?", "Thank you!"], ["Project edge cases and EC question.", "Per the instructions after a course is entered, a category is entered on the client side and the query is sent off to the main server.", "If the course number isn't found the client gets an error message that the course wasn't found.", "qs:\n1.", "If the user mistypes the category name (eg: Porfessor rather than Professor), what should the error message be?", "2.", "Can we assume that the user will always enter the category correctly?", "3.", "Can we assume that there will always be a valid attribute (eg a string gte 1 char) for each category of every course?", "For the extra credit section, the project description only shows client outputs for successful queries, while the single query output provide \"error handling\" for course not found cases.", "qs:\n4.", "What should happen if one or more of the courses aren't found in the query?", "5.", "Should we expect multi-query course codes to always be valid?", "6.", "If the same course is entered twice do we need to detect this and only provide a single output?", "We are only given 5 courses in the test file.", "For testing the EC we'll need to test for up to 10. \nqs:\n7.", "When writing our own course list can we get a guarantee that the course list files will be the same format as the ones we are provided?", "Including Windows CRLF line endings like the one provided to us?"], ["Extra Credit Question.", "In the description, it asks us to send the request to the corresponding department server with all courses together.So for example, if the request contains (EE450 EE669 CS402), we have to send (EE450 EE669) to ServerEE and  (CS402) to ServerCS.|Is this mandatory?", "Can we send the request course by course instead?ex:EE450 -> ServerEEEE669 -> ServerEECS403 -> ServerCS"], ["Homework 2 - Chapter 2 - Question 7.", "What is the correct answer to this question?I answered RTT0 + RTT1 + … RTTn"], ["Project query.", "Are we allowed to program in C?"], ["[PSH, ACK] vs. [ACK].", "I highlighted some of the segments from thetcp-ethereal-trace-1which all appear to have text from Alice in Wonderland in their Data fields.", "I am unsure as to why some of these do not have the PSH bit set to 1 and why the segments with[PSH, ACK]have a different length from everything else.I can't discern any reason or pattern going on and was unable to find anything in the textbook indicating why this would happen.Does[PSH, ACK]vs. just[ACK]make a difference when considering segments for the \"first six segments in the TCP connection\" for Q7?"], ["Client port number.", "Should the client port number (which is dynamically assigned by system) be same for authentication and query sent to main server?"], ["Buffer size, number of packets received.", "Looking at the provided trace for lab 2, I have a question about what exactly is going on here.", "It seems like this pattern in the below snippet repeats itself.", "The server acknowledges the next packet it's ready to receive, in this case 25397.", "The client then sends 25397 and four additional packets after that.The server already sent the acknowledgement for 25397, so those bits are accounted for already in it's window.", "The following four packets have a total size of 5840, which makes sense since that's the window size the server advertised at the beginning of the session.My question is about the highlighted packet of size 892.", "This seems to push past the advertised size of the receiver's window.", "What is this packet?"], ["The TCP protocol on Wireshark is different than the one in the textbook?.", "Hi,So the textbook says that the ACK field is for the number of the next expected sequence.", "Why do my ACK packets seem to have the sequence number of the received packet instead in the ACK field?Thanks."], ["Missing Acknowledgments.", "Many segments which were sent to the server are not acknowledged by the server and are never retransmitted.", "See the segments in snippet below marked with red lines.", "I thought TCP ensured no lost packets?"], ["Two source ports when uploading Alice.txt.", "Dear everyone,Would somebody please explain to me that why am I having two source port number when uploading Alice.txt?Thank you very much."], ["Files transimmission between VM and Windows.", "Does anybody know how to move the txt file to the VMI used to pull the file between them but it doesn't work in the StudentVM_Spring Mirror System."], ["Is it possible that my computer sends segments using two ports?.", "Hi, it seems that I may be sending segments using both port #57414 and port #57417.", "The server seems to respond to them too.", "Does this indicate that I have two ports in use to send the file?", "If yes, should I mention both ports in the first few questions when it is asking for the source port?", "Thanks."], ["question 13 and 14 in the lab.", "how to answer this question?", "the Comment on ways in which the measured data differs from the idealized behavior of TCP that we’ve studied in the text.The graph below is generated by my own captured packets.", "I do not see the slow start from this picture.", "What is wrong with it?Thank you very much!"], ["Accumulative ACK&#39;s. Hi, I have a question about the ACK time of the first six segments.", "It seems that accumulative ACK's are used in my trace based on the ACK value jump.", "In my case, should I consider the ACK receive time for my segments #7, #8, #9, and #10 are all 0.166935?", "Thank you"], ["Few questions on Wi-Fi: interference, channel overlapping, and DIFS.", "I have a few questions about today's lecture on Wi-Fi:\n\n1.", "An interference example given in the lecture is APs operating on the same frequency at a short distance.", "How about the wireless units?", "In order to connect the same AP, they must operate on the same frequency as the AP, thereby they must interfere with each other, am I right?", "2.", "The professor said that channel #1, #6, and #11 are the only non-overlapped channels.", "How about channel #2 and #7?", "I suppose they should not be overlapped as well.", "3.", "I didn't see any meaningful functionalities of DIFS, especially in the professor's later (unfinished) example on slide page 37.", "DIFS does not guarantee a safe/proper transmission environment, and it can be a waste of bandwidth.", "Why not transmit as long as the media is idle?", "Did I miss anything?"], ["Throughput Calculation.", "On question 12 of the Lab, we are asked to find the throughput.", "In the book I found $$Average Throughput = \\frac{0.75*W}{RTT}$$.", "I calculated the RTT from a previous question, but how the window value (W) is calculated???", "it should be the max, min of the TCP connection??", "?"], ["Confusing ACK segments.", "Left is the ethereal trace.", "Right is my trace.I don't understand the purpose of the ACK marked with a curly brace on the right trace.", "Why does it send ACK with those acknowledgement numbers?", "The left trace seems to have a clear acknowledgement paired with each received packet.EDIT: Is this selective ack?", "Is the receiver just receiving chunks at a time and sending ack each time?"], ["About midterm scores.", "Hello, the PPT said that the scores of labs would be added to my midterm score.", "I wonder if I get 90 in midterm and 20 in lab, will my midterm score be 100 or be more than 100?"], ["Final exam material.", "Will the final exam be cumulative for the entire semester, or will it just contain material since the midterm?"], ["Issues with Virtual Machine.", "I am having an issue with the virtual machine when I am trying to type code for the project.", "There seems to be a bit of a lag and occassionally I will type type one letter and then I lose control of the virtual machine and it types this letter non-stop.", "This is an issue because it also happens with the backspace button and its come close to deleting a good portion of my project code.", "Does anyone have experience with Virtual Machine and know how to prevent this from happening?"], ["Project Environment.", "I already have an installed ubuntu 16.04 VM in my Virtualbox.", "I assume I don't need to use the provided VM from cs103 website since they have the same enviornment?"], ["Project: Question about the special characters and character sets.. For Phase 1, may I ask what are the special characters?", "are these non English alphbet and non numerical characters?", "For instance, are σ and ä special character?For the character set, are we going to use ASCII?", "Or any character set is acceptable as long as the offset is 4?"], ["Readme formatting.", "I see that the project description asks for either a .txt or .md format for the readme.", "What software will graders use to view the readme while grading?", "I want to make sure my markdown formatting will be visible to the graders"], ["Amazon VM setup.", "The piazza post mentioned to use Ubuntu 16.04 but the link to the documentation mentioned to use Ubuntu 18.04Can anyone confirm what should we use?"], ["About Lab3 guideline.", "Unlike the labs before, I didn't find a PDF guideline for lab3 in the professor's email.", "Is the PDF guideline somewhere else?"], ["cred.txt end of line.", "Hi, I noticed that in the given cred.txt file, the end of line character is '\\r\\n' (CR + LF), which is the new line character of Windows.But in Unix, we should have '\\n' as the new line character (please correct me if i'm wrong)Is that a mistake due to platform conversion?", "Or we need to handle the end-of-line as '\\r\\n' specially?"], ["Discussion-10 General doubt.", "During discussion-10 (21 Oct, 2022) I am not able to understand while solving the last problem, why we concludedR1 = (16R/7) and R2 = 4R.Can someone please help me understand the logic behind this ?"], ["Question about project.", "In the project, all servers run on my computer, so all the sockets are going to have the same ip address, right?", "How about the port number?", "Thank you."], ["Jam Signal Length after Collision is Detected in CSMA/CD.", "I understand that the jamming signal is to inform other hosts on a broadcast link that they should not transmit.", "How do we determine the length of the jam signal?", "Is it a fixed amount?", "Or should it be the length that is required (when added with the length of the frame already transmitted before the collision is detected) to fully fill the link.", "If it's the latter then how does a host know how long the link is (ie.", "how does it know what Tp is)?"], ["Project - course attribute edge cases.", "In the example CS and EE course files, the course numbers are 5 characters in length and have a single 'character' credit number (eg 0-9).", "Can we make the assumption that we will be graded using only course numbers that are 5 characters?", "Unlike EE457L, which is 6 characters.", "Additionally will the number of credits in the cs/ee.txt files used to grade the project always be a single digit (0-9 rather than 10 or greater)?"], ["Lab 3 Problem 10.", "I am wondering whether we need to count all the authentication frames from around t = 49 sec or we just need to give the first time that the authentication frame happens?"], ["About Lab3 submission.", "Hello, I cannot find the dropbox folder for lab 802.11.", "Is the folder not created yet?"], ["Chapter 7 Question.", "I'm trying to understand the first two sentences here.", "Is this saying that the AP has two MAC addresses, one on the wifi interface side and a different one on the router side?"], ["Checking the username.", "In client side, we are to input a username and passwordIn the writeup file, it states that the username and password should be from 5-50 characters and username should all be lowercase letter.", "Do we need to check for these conditions in client.c ?", "If so, what should be the printout on screen if a username/password fails to match the condition.", "Thank you."], ["question 18 hw3.", "What does 325 bit times mean?", "What does at time t = 0 bits mean?", "Thank you."], ["question 23 in the homework.", "How do I calculate the aggregate throughtput in this question.", "If a host transmits at 1gbps to another host, the tranmission takes up the data rate of links connected to both of them, but the throughtput is just 1gbps, right?"], ["Chapter 6 P22: IP and MAC addresses?.", "Hi,Since hosts' and the routers' IP and MAC addresses are not stated in Figure 6.33, I would like to know where we can find them?"], ["Question 19.", "If the propagation delay is 245 bit times, that’s 24.5usec.", "If they both detect a collision at 245, then they both need to give off the abort signal, then wait their random number of useconds, then wait for DIFS (50usec).", "At that point, A will notice no one is transmitting and will start to transmit.The problem says KB = 1, but 1 what?", "1 bit time?", "1usec?Whatever that delay is, B will wait that amount of time.", "B will not notice that A has begun transmitting because the propagation time is 24.5usec, so it will start transmitting again and another collision will occur.We don’t know how long the abort signal is, or what the units of KB are, so we don’t know when exactly A or B will schedule their retransmission.", "How do we approach this question?"], ["HW3 Q19.", "For question 19, do we need to take into account the Interframe Spacing.", "I see on wikipedia that a value of 96bit is used.", "If we need to account for this, do we use this value or is there another value we should apply.", "Thank you"], ["Question about  messages at the client side.", "I have trouble figuring out which of the messages at the client side show first in the terminal.", "Should we show the booting-up message first, or should we show \"Please enter the username\" first immediately after user inputs \"./client\"?"], ["Backed Server messages.", "(Extra Credit Portion) If one of the backend servers receives the request with multiple course codes (i.e.", "<course code> <course code> <course code>), what are the corresponding on screen messages that should be displayed at the backend server?EventAfter Receiving the request from the main server:  \"The Server <EE or CS> received a request from the Main Server about the<category>of <course code>.", "\"If the course is found: \"The course information has been found: the<category>of <course code> is <information>.", "(Extra Credit Portion)<category>is not provided with these requests.Please advise."], ["Q19 hw3.", "Based on my calculation, A's retransmission reaches B at bit time 490, and B's schedule's time is at 757 bit times.", "How do you answer the question, does B refrain from transmission at scheduled time?", "I mean A may finish transmission before 757 bit times, then the channel is idle, so B can transmit....The answer should depend on how long A transmits, right?"], ["Questions about: when to close the socket, dynamic ports and possible passwords.", "Hi I have a few questions,1.", "I know that for the servers (serverM, serverC, serverEE, serverCS), we do not close the sockets for the duration of the program because they are servers.", "But what about for the client?", "Can we assume we are running over a persistent connection and can leave the socket open until we are done?", "Or, do we make a new socket every time the client sends and receives a message from serverM?2.", "Am I correct to say that the client TCP port is the only port that will be generated dynamically?3.", "From the table below, it seems like the passwords can include spaces.", "Since the passwords can include special characters as well, are we allowed to send the password  from the client in one TCP message and the username in a separate TCP message to serverM?", "I want to do this so I know where the username begins and where the password ends?"], ["Lab #3 - Question on Q2.", "Hi,Q2 of Lab 3 asks that we provide \"the intervals of time between the transmissions of the beacon frames thelinksys_ses_24086 access point\".", "However, when I search through the beacon frames in the \"wireshark_802_11\" file, I do not see any beacon frames from this AP.", "I only see probing frames from linksys_ses_24086.", "I do, however see several beacon frames from an AP called \"linksys12\".Could the question have meant to refer to \"linksys12\" instead?", "Or, is a \"probing frame\" technically considered a \"beacon frame\".Another somewhat unrelated question:Do we get graded on these labs or are the purely for extra credit?", "I ask because I have not received any grades/feedback for Labs #1 & 2 and hope to get some before turning in this lab."], ["Server - Server Communication using UDP.", "Hello,Hopefully my understanding of the UDP code and client server process is correct, otherwise none of my questions will make sense below.So from beej's networking guide (link), it seems like part of the process of communication from a client to a server is for the client to ensure it's setting up it's socket so that it has compatible socket address parameters with the server.", "In the screenshot below, the getaddrinfo function is used by the server to set up a socket based on the parameters specified (i.e ai_family, ai_socktype, and ai_flags).", "However, on the client side, they populate these parameters so that they match the parameters of the server that they'resendingto.So does that then mean that the following needs to be the same on the clientandserver side:ai_family --> this is IPv4 or IPv6ai_soctype --> it's clear that this will be SOCK_DGRAM from both the client and the server so no questions hereai_protocol --> beej uses a default of 0 for the server and client hereOther Questions:What do we do if, for example, serverM is using IPv4 on Port #23000 (just an example) and serverC is using IPv6?", "Do I have to use port #23000to send UDP messages to serverC?", "Or can I open a separate socket for M so that it becomes a \"client\" and then the program canintentionallypick a socket that is compatible with serverC.OR, should I just make sure that all servers are set up exactly the same and are therefore are all running under the same IP family (beej uses IPv6 so that is what I would default to)?", "If I set them all up in the same way, then I won't have to make sure the sockets are compatible every time I send a message between the servers - that is my understanding?Basically what I'm trying to ask is how do you ensure communication is compatible between twoserversin UDP?", "It's not an issue with client/servers because the client will always pick a socket that as parameters that matches the server or return an error.", "But with servers, once you turn them on (i.e set up the socket), they shouldn't suddenly change their parameters.", "It feels like a deadlock in a way."], ["question 5 in the hw.", "The questions mentions ip address block.", "What does this mean?How do we answer this question?", "To me, the answer is simply that there is interference in the first case, because two aps use the same channel.", "In the second case, there is no interference.", "Is that it?Thank you."], ["Flooding.", "I was re-watching the 10/11/22 lecture and was wondering why flooding will flood to all interfaces rather than excluding the interfaces for which it has already associated a MAC address.Using the example in the slides, after it does A->C, why do future messages result in a flood to the port that A is on?If the switch can already choose to exclude nodes why not exclude these nodes as well?"], ["Question about TCP transmission.", "In my code, I send 2 messages to the main server (use 2 \"send\" commands in the client.c) and use 2 \"recv\" commands in serverM.c to receive these 2 messages separately.", "However, I can only receive the first message at the main server sometimes.Is there something goes wrong?", "In order to send 2 separate messages, how should I write the code?PS: after the 2 \"send\" commands, my client.c program endsPS: sometimes i can receive both messages but sometimes i can only receive the first message"], ["Project conflicts.", "In table 7, Main Server on screen messages the event: \"After receiving the query information from the client\" should generate the following message:\"The main server received from <username> to query course <course code> about <category>using TCP over port <port number>.However in the \"Example Output to Illustrate Output Formatting\" section of the Main Server Terminal, the corresponding message is different:\"The main server received from James to query course EE450 about credit.This seems to be the case for a few others as well.", "Please advise."], ["P22 Switch vs Router.", "When I was approaching P22, I was trying to distinguish between router and switch:I understand:- Router is a network + link + physical layer device, and has distinct IPs or MACs on each interfaces.", "It usually helps us to count how many networks we have in a graph.- Switch is a link + physical layer device and doesn't recognize IP.", "Will we have two distinct IPs or MACs on each interfaces of Switch then?Thanks in advance!"], ["Backend servers cannot find .txt document.", "When running my program of backend server using terminal, my program cannot find and open its corresponding \".txt\" document.Take serverC as an example: I put the\"cred.txt\" file in the same directory(or folders) as serverC terminal and serverC.c's.I use \"fp = fopen(\"cred.txt\", \"r\");\" in my program, however when the terminal is running, it cannot find and open the \"cred.txt\" file.Can someone help me out of this problem?", "Thanks a lot in advance!"], ["HW3 Q19 Question about IFS and when nodes start retransmission.", "Hi,I'm very confused about when nodes start retransmission.", "In the 10/12 discussion, retransmission of A starts immediately after the medium is idle.", "But shouldn't it start after the IFS time?Does B start its 512 bit times backoff once IFS time is done?I couldn't get a clear answer from other Piazza posts about this topic."], ["Host MAC Changed in Lab 802.11 Question 7 &amp; 8.", "In the downloaded trace data, the host sent a SYN(No.", "474) and received a SYNACK(No.", "476).", "I found the MAC of the host changed between these 2 packets (00:13:02:d1:b6:4f in ACK and 91:2a:b0:49:b6:4f in SNYACK).", "However, it seemed 91:2a:b0:49:b6:4f did not show up in later packets.", "Can anyone explained this?"], ["HW3 Question 18 Bit TImes.", "When the question says 512 + 64 bit times is it just (512 + 64) bit times or is 512 in another unit?"], ["Disassociation Procedure in Lab 802.11 Question 9.", "I am not sure what is the missing frame.", "Where can I find it in the 802.11 specification?"], ["Any requirement for comments, documentation or variable name of the project?."], ["Doubt Problem 6.18.", "I am a little confused while solving P18, in the event of a collision, should we include the jamming signal (B will send it to A and vice-versa)?And what will be the time it will take for the jamming signal to propagate (will it be default propagation delay 325-bit times)?"], ["WLAN practice problem Q3.", "Hi,For Q3, B is in range of A but A is not in the range of B.", "When B starts sending at t=150, does A pause its own backoff timer until B is done?", "Or will it continue and send at t=200?I'm guessing that since B is in range of A, A will know medium is busy and pause its backoff timer but I'm not sure."], ["Q7/8: How do the 4 address fields correspond to the four MAC addresses displayed in Wireshark?.", "I have two very related questions for Q7 and Q8:1.", "How exactly do the four address fields in the frame header correspond to the four address names shown in the 802.11 frames in Wireshark (i.e.", "Receiver, Transmitter, Destination, Source)?", "Neither the textbook, lecture slides, or 802.11 spec ever correlate the two sets.", "I've deduced it's likely the mapping below, but wanted to confirm:Address 1 = ReceiverAddress 2 = SourceAddress 3 = DestinationAddress 4 = Transmitter2.", "If the mapping above is correct, then in the SYNACK frame, why is the source shown to be the router (MAC address: 00:16:b6:f4:eb:a8)?", "Based on lecture, shouldn't the AP be the source (address 2) and the router be placed in address 3?", "(Although I suppose in this case Address 3 = Destination doesn't make sense)Do these labels change depending on the direction the frame is traveling?", "That would actually make more sense."], ["P22 star-connected.", "Hello.", "I couldn't understand what the network looked like after the replacement.", "For example, how many MAC addresses does the star-connected switch have in this case?", "Since it's connected to (A, B), (C, D), and the router, I guess it has 3 MAC addresses, is my understanding correct?"], ["HW3 Question 26.", "In the book the switch table lists 3 columns: MAC address, interface and time.", "Can we just show the table with just MAC and interface or do we have to fill in the time column?", "If we have to list the time should we just list the event number?"], ["Why does a switch have MAC address (p22 related).", "Since a switch is transparent to nodes, the receiver or sender's MAC address of the frame should not be the switch's MAC address.", "If this is the case, why does a switch has a MAC address in the first place?"], ["Is course code all upper cases?.", "1.", "Will the course code input be all upper cases?", "For example, will it be like EE450 and CS402, NOT ee450 and cs402?2.", "Will the category input be exactly the same as one of:  'Credit', 'Professor', 'Days', or 'CourseName'?", "(I'm checking for an exact match, so if the case is different, my program will fail).Thanks."], ["Extra Credit Problems.", "The professor mentioned some practice problems would be provided which will give 10 additional points of extra credit that count towards the midterm.Have those problems been made available yet?", "I saw some practice problems on D2L, are those the ones which will provide the extra credit?If so, is there a due date for these problems?Thanks"], ["10/28 discussion recording.", "I cannot find the recordings for the discussion session on last friday (10/28).", "Was there a session?"], ["Question about project.", "Hello, I want to specify one thing about the phase 3 of the project.", "I wonder if the course code and the category are case sensitive or not.For example, when the user inputs \"ee450\", does this equal to \"EE450\"?", "When the user inputs \"professor\", does this equal to \"Professor\"?"], ["Why we need SIFS?.", "What could go wrong if a receiver can send ACK immediately after it received a frame?"], ["`sig` function confusion.", "Hi,  I copy/pasted code from the text book to my editor but ran into the issues below.", "Does anyone know how I can fix this?", "Thought those functions should be default?", "Thank youserverM.c:48:5: error: implicit declaration of function 'sigemptyset' is invalid in C99 [-Werror,-Wimplicit-function-declaration]sigemptyset(&sa.sa_mask);^serverM.c:50:9: error: implicit declaration of function 'sigaction' is invalid in C99 [-Werror,-Wimplicit-function-declaration]if (sigaction(SIGCHLD, &sa, NULL) == -1) {"], ["Static UDP Ports.", "Can we use a static UDP ports for sending data from serverM to the backend servers?", "and visa versa?The project description says the UDP ports for serverM, serverC, serverEE, and serverCS must by static and binded.", "However, I cannot get the sockets associated with serverM to work forSENDINGunless I create a new socket.It's the same situation with the backend severs.", "I can send a message to serverM directly if I capture the address that it used to send the message to the backend servers, but this would be associated with a dynamic port, not a static one.", "If I wanted to send a message to serverM's static UDP port, I would need to create a dynamicsendingsocket for the back end servers.If there is a way to get these ports to work otherwise?", "Can someone please provide guidance?"], ["HW3 Question 24.", "Referencing page 8/9 of EE450-Hand-written-notes-10-11:If we were to connect the hub to the switch (as is done in question 24), I am confused which set of rules would take priority.", "Could the connection between the two be FDX since switches can support this or not since hubs do not support FDX?", "Is there some sort of hierarchy at play that I'm completely missing here?For hubs, we see that the link would get the 1/N average throughput across it (N being the number of nodes) whereas for switches, we see that the link would get the full dedicated link throughput, so I am under the impression that this distinction is important to calculating the network throughput.Even after re-watching the discussion and the relevant lecture and textbook section, I am still confused about how we can determine throughput of this network.In the discussion, the TA showed that the rate in either direction of hub-switch link would be possibly different (ex: R1 = (1/7 x 4)4R and R2 = 4R).In the case that the hub-switch link is HDX I don't understand the role that these R1 and R2 values would play in the throughput calculation for the network as a wholeIf the link truly is FDX, then are the switch to hub links just 1Gbps in each direction and overwhelm the the departmental network?", "Or, does this link get a throughput of 1/4Gbps and not utilize the whole link despite being a dedicated link?"], ["Why we need the jamming signal?", "Couldn&#39;t all nodes detect the collision themselves?.", "According to,\n> When a collision is detected, in practice a node detecting the collision cuts off its transmission and transmits a short jam signal.", "(This allows the other node to detect a collision, which it could otherwise miss if the second node stayed on for a rather short time interval).", "I don't understand why would other nodes miss the collision.", "What does \"it could otherwise miss if the second node stayed on for a rather short time interval\" mean?"], ["About getaddrinfo..", "When I use this piece of code in the client.cpp, what should I put into the getaddrinfo?", "What is the ip address and port number?Thank you"], ["HW3 Question 26 - another situation.", "Hi!", "I am just thinking of a situation and am sorry if I missed the information from the class.Let's suppose a learning switch has the MAC of interface related to C and does not have the MAC of A and B.", "Suggests A wants to send a frame to B.", "In this case, will the switch simply broadcast to everyone or it would omit those that are already in the table(e.g., C)?", "Thanks!"], ["Project UDP location of freeing addrinfo servinfo.", "As I am working on the UDP sockets, I realized that the struct addrinfoservinfocannot be freed before the data is sent.", "However, In TCP, theservinfocan be freed just after bind(), and will not affect TCP's data transmission.May I ask why this is the case?", "Which chapter of Beej's book should I revisit for this problem?"], ["SSID Confusion.", "I have been looking through the trace given in Wireshark_802_11.pcap and I don't know what I should put for the SSID because there is a old symbol in the second most SSID.", "I have provided a comparison of the number of beacons of the top SSIDs:"], ["Client input checking.", "In the example of description of encryption, there is an example with space.", "Should we consider the case where there is space typed by user?", "Also, do we need to consider the case where the length of username and password is out of range?"], ["IP version for the project.", "Is it safe to assume that the scope of the project is limited to handling IPv4 only and we do not need to handle IPv6?"], ["Multiple Thread Probelm for Project.", "I want to use <thread> in the project, but the #include<thread> is for C++11 standardHow can I do with this?"], ["Probe response.", "Hello,From what I understand about active scanning, APs will always respond to a broadcasted probe request.", "However in the 802.11 trace, I can't find any probe responses from the linksys_ses_24086 AP.Does this have to do with the fact that it is not an open access point?What exactly does it mean for an AP to not be an open access point?"], ["Lab3 Q16: Why the AP sent multiple PROBE RESPONSE to a single PROBE REQUEST?.", "In the screenshot below, the AP sent multiple PROBE RESPONSEs to a single PROBE REQUEST when the SSID in the request doesn't even match the SSID of the AP.", "Why it is doing that?", "!", "[image.png](/redirect/s3?bucket=uploads&prefix=paste%2Fkstgcobulb14t3%2F96eb5503c4d416855c46c0506cd154c56adbf2fa7e535baa351a06fa6e26a714%2Fimage.png)"], ["Question about reading file line by line.", "When I am reading file line by line using the function getline and trying to print it, the string after the line went to the front and replaced the same length character of each line.", "Does anyone know why is this situation and how to fix it?"], ["Question about the folder name.", "The format of folder name is ee450_YourLastName_YourFirstName_yourUSCusername.tar.gz.Should we include the digits in our USC username?"], ["compressed file does not have .tar extension.", "When I used the tar cvf ee450_YourLastName_YourFirstName_yourUSCusername.tar * command in the given studentVM (CS103, develop), I got a file name of ee450_YourLastName_YourFirstName_yourUSCusername.", "The type is Tar archive(application/ x -tar) but the .tar extension does not show up in the name of the file.", "Is there any thing I can do to fix this?Thank you!"], ["field length of courses and query input length.. For the \"Professor\" and \"course name\" field of the course, is there a length limit, or there is no limit?Also, for the multi-course query, will there be a max number of course per query?"], ["Encoding course code at phase 3.", "In the description, we were asked to encode the course code based on which departments it is before sending to main server.", "Can we directly send the course code, such as EE450 to main server and then decide which department server should it forward to?"], ["How does the NOS know whether the software is a client or a server.", "In the class, professor mentions that the client does not need to bind the socket to the address, and the NOS will pick a port number for the client.", "But the code to create a socket for a client and a server is the same code.", "How does the NOS know whether the socket is for a client or a server?", "Thank you.."], ["Project extra credit question.", "For the extra credit question:What will the output look like if user enters duplicate course codes in the same query?eg - EE450 CS100 EE450What should the output look like if we can't find one of the entered course codes?", "Can I display it as below?CS356: 4, Marco Paolieri, Tue;Thu, Introduction to Computer SystemEE450: 4, Ali Zahid, Tue;Thu, Introduction to Computer NetworksEE648: Didn’t find the course"], ["HW3 Solution.", "The posted solution for Chapter 6 problem 23 is confusing.", "The posted solution is 11Gpbs, why isn't it 12Gbps?I see qty 12 Gbps links in the figure.The referenced figure from this problem (below)Thanks,"], ["Unable to start miniedit.", "I am unable to start miniedit through virtualbox using command `sudo ~/mininet/examples/miniedit/py` Keeps throwing error: _tkinter.TclError: no display name and no $DISPLAY environment variable.", "Wonder how we can work around this?"], ["about the recv.. What is the buffer length in the recv?", "When I create a char *buf, do I have to specify a length?", "Thank you."], ["How does client send to mainserver the username and password?.", "Should the client call send twice?", "On the server side, after the server accepts, should the server call recv twice??", "Thank you!", "!"], ["Unale to start miniedit.", "hello I am having trouble starting miniedit, I keep getting this error: (this is when I use both python and python3 commands).", "I downloaded the recommended mininet VM.", "I know someone else had a similar issue but I was not able to resolve mine."], ["Should I submit the JSON file with report or only the report?."], ["Issues with Virtual Machine.", "I have a very hard time getting the Ubuntu environment to run properly.", "I normally start up the Virtual Machine and then I get one of the following errors:1).", "Anytime my cursor is over the VirtualBoxVM window it disappears and I cannot select anything.2).", "If my cursor is available, I will be able to attempt a log-on, but after inputting the password and selecting enter the Virtual Machine just freezes and never logs on.It normally takes 5-10 tries in order to get the VirtualBoxVM to load properly once I get on and even then it is a very laggy connection.", "I am using a MacBook Pro with 12.3.1 OS.", "Does anyone have any advise on how to help this or has similar issues?"], ["Failed to import Mininet Image to VirtualBox.", "When I double clicked the mininet ovf image file and tried to import it to virtualBox, I got the following error:Error opening 'C:/Users/wzcbl/Temp1_mininet-2.3.0-210211-ubuntu-20.04.1-legacy-server-amd64-ovf.zip\\mininet-vm-x86_64.vmdk'for reading (VERR_FILE_NOT_FOUND).Does anyone know what this error means ?PS:The virtual box is running on Windows OSI have turned off the Hyper-V  (due to the conflic between virtualBox and hyepr-V)"], ["Openswitch Issue.", "I installed the mininet on Ubuntu 20.04 VM running over Windows' WSL2.", "However, I was not able to pass the test step.", "The following screenshots are the error I get.", "The cause of the failuer seems to be theopenvswitch.", "I haven't found any solution yet to this issue.I also tries to run the following comman to install openvswitch:mininet/util/install.sh -s ./mininet-wzc -vBut it still ended up with the following errors:Does anyone has an idea about solving this problem ?"], ["Updating Ubuntu for Lab 4&#43;5.", "Will updating ubuntu to 20.4 in one virtual machine affect any of the other VM's I have in virtual box?", "I just want to make sure my updating the VM in the command line per post @299 is not going to affect the separate VM I have for the project and for my other  class.Also, what is the password to login?", "The passwords they posted in the lab is not working for me."], ["Will address aggregation causing identical entry in the forwarding table?.", "Referring to the example on slide 10 of Routing Algorithms, if Organization 2 also moved from R1 to R3, can R1 and R3 still aggregate the IP addresses?If R1 and R3 aggregate, I computed that the IP information sending to R2 will both be 140.24.7.0/24.", "What will happen in this case?"], ["Project Edge Case.", "When checking if a course exists or not, do we assume the user will always enter EEXXX/CSXXX and only change the three digit number?For example, the user enters EE000 or EE001."], ["Checking Course Status in Multi Course Query.", "When doing multi course query, if a course does not exist, while other courses exists, what will be the output?", "For instance, what will be the output displayed on the client with the following input?EE450 CS100 CS000 CS356 EE503Where CS000 does not exist"], ["how should we communicate with servers.", "Hello,Are there any requirements for the request/response format during the communication?For example, if the client were to send the username and password to serverM, should it send all the information at once or separately?", "What should be the format of the message?", "Thank you."], ["Block size in term of number of hosts and number of addresses.", "What's the difference between Block size in terms of the number of hosts and the number of addresses?In my understanding in term of number of host is 2^(32-n), but whats the size in term of number of address?Thank you!"], ["Is 128.124.0.0/14 the USC network?.", "I don't think it is the USC network since they do not have the same network id, but I am not sure about it."], ["Port Number Print out Issue.", "After receiving a message, the client is supposed to print out an on screen message.", "And in the picture, the client should print out a \"<port number>\".", "I was wondering whether it's the port number ofthe clientorthe main server?"], ["What are we submitting for Lab 4&#43;5?.", "Hello,Maybe I'm missing something but what exactly are we submitting for lab 4+5?", "Is it just the iperf plot at the end of the lab?Are we supposed to be screenshotting any steps as we go along?Are there questions to answer somewhere?"], ["Not receiving credential result via UDP.", "Occasionally my credentials authentication result is notreceivedby server M from server C, although server C sends the correct string.", "The only conclusion I've been able to make is that it seems to work when I have only the authentication loop.", "Specifically when I introduce the if/else statement for the multi-course querying in the second loop it seems to cause issues in that first recvfrom(), but I am very confused since these two sections shouldn't affect each other.I have not split my code into functions and am simply calling all the UDP steps every  time when I need to sendto() and recvfrom().", "This would mean that some code/variables might be repeated e.g.", "memset(&var, 0, sizeof(var)) or int udp_socket_descriptor; or buffer_udp[#]; in multiple places.", "Could this be an issue, or do you have any ideas of what else it might be?", "I'm very confused why it is working for some code."], ["How to run miniedit?.", "My ubuntu version is 22.10 now, when it was 20.04 before I upgraded it, the same error was reported."], ["Question about Project Phase 3.", "When user inputs a course code like \"MEXXX\" in phase 3, can ServerM just don't send anything to the backend server and tell the client that it cannot find the course immediately?"], ["IP address for Lab5.", "Since we are using the topology generated from the previous lab(lab4), does it mean we are using 15.0.0 instead of 10.0.0 as the network address?"], ["no NetFlow target specified.", "When I ping 10.0.0.2 on host 1 in miniedit, the destination is unreachable and there is an error:no NetFlow targets specifiedno sFlow targets specifiedHow to solve this problem?"], ["Output format in phase4.", "Hello, I wonder how many lines  we should leave for empty between the \"-----Start a new request-----\" and its last output line(such as \"Didn’t find the course: <course code>\")."], ["Submission location for lab4&amp;5.", "Is the location to submit lab4/5 up on Den?", "I'm not seeing a place to submit at the present time."], ["Lab 5 home/admin/lab_topologies.", "When setting up Mininet on Ubuntu VM, the \"home/admin/lab_topologies\" folder wasn't installed.", "Is there a separate package that needs to be installed to receive those files?"], ["Credentials one word for project.", "Can we assume the credentials for a user is one word?", "I'm asking because the cred_unencrypted.txt uses only one word credentials but the example of the encryption had \"Welcome to EE450!", "\"."], ["Commas not allowed in usernames, passwords, or course details?.", "Since commas are used to separate the fields in all the text files (credential text file and course information text files), can we assume that the usernames/passwords cannot contain commas?", "(And also, that the course information cannot contain commas, although I think this is already specified in the project PDF)."], ["question about udp between serverM and serverC.", "1.", "Does serverM need to bind the udp socket with its own address?", "So serverM should call getadreessinfo twice, right?2.", "After serverM send username and password to serverC, does serverM simply call recvfrom afterwards and hope serverC sends the result back?", "I feel there is some kind of racing here.", "Thank you"], ["About starting the terminal windows of the project.", "Hello, I want to know that if this means that when TAs start serverX (X means M, C, CS or EE), they will type \"./serverX\" directly in the terminal windows to start the servers?"], ["Other libraries.", "Hello,Can we use libraries other than standard libs?", "ex.", "JsonCppThanks."], ["Can we include an additional .cpp and .h pair of files with refactored code?.", "I have a function that I want to reuse between source code files.", "Can I include eg a 'utilities.cpp' and 'utilities.h' pair of files in my submission, as long as the other required files are present and 'make all' works?"], ["Question about Submission.", "Hello, I want to ensure one thing about the folder name of the project: is the uscusername our USC net id which we can use to access myUSC?", "I'm kind of confused and thanks for your answer!"], ["How to store credentials?.", "Hello,I want to store each credential pair as a struct in some sort of data structure like a linked list but C does not have linked lists in the standard library.How am I supposed to approach this?", "I feel like I'm missing something here..."], ["Bit Error and Packet Loss in Project&#39;s Connection.", "Since the TCP and UDP are running at localhost level, will bit error occur?", "Shall we handle such problem?", "Also, will packet loss happen, and shall we handle it?"], ["On-screen Message of Servers for Excra Credit Problems.", "Since the on-screen message for server is not specified, can we use whatever on-screen message that is appropriate?"], ["Login function in the project.", "Hi Prof. Zahid and TAs,In the instruction of our project, the username and password have the following constraints.However, according to the instruction, we just need to show \"Username does not exist\" or \"Password does not match\".", "Thus,do I need to show \"The username is invalid\" or \"The password is invalid\" if I enter a username or password which is shorter than 5 chars or longer than 50 chars?Thank you;)"], ["Make Warning.", "Dear Prof. Zahid and TAs,My code and acquired functions can be successfully executed, but when I enter \"make\" to compile it, these two Make Warnings will show.", "Is this ok?Thank you!"], ["Lab 4.", "Every time I click run button in miniedit，the miniedit would corrupt and closed itself……Why it would happen？"], ["for loop for login retries.", "I wonder how to utilize for loops for login retries?", "I tried setting up a for loop in the client side but it takes in junk values at the second attempt.", "I also tried setting up for loops in the server (serverM) side, but it also doesn't seem right.", "Wonder what kind of values need to cleared after each loop?"], ["Print &#34;finished sending the response&#34; message if the course code was invalid?.", "1)For the backend department servers, we have to print this message to stdout after sending the results of a course query to the main server:\"The Server<EE or CS> finished sending the response to the Main Server \"In the case where the course code is invalid / does not exist in the dataset, should I still print this message?", "I am technically sending a response to the main server to indicate that this error occurred, but I am not sure if this message should still be printed or not.2)Same question but for the Main Server.", "We have to print this message:\"The main server sent the query information to the client.", "\"After sending the query information back to the client.", "But sometimes my main server receives the error of course not found from the department backend server, in this case I am technically sending something to the client to indicate this error, but should I still print this message?", "Also, sometimes my main server does not even contact a department server because it detects that the course code does not begin in CS or EE so must be invalid - should I print this message in these cases too?Thanks!"], ["README Question - e. Hello,In the project specifications the readme document asks for the following:e. The format of all the messages exchanged.What do you mean by this?"], ["Project References.", "Is there a format we need to follow when we are referencing a source we used during this project?", "Like a specific type of information (ie.", "URL, Page title) and if so should we put the reference in a specific place in the code, or in the comment before the function it was used in work?"], ["project development enviroment.", "Can  I code at VS code on my Macbook(as MAC also uses Linux and the command are about the same) but not on the VM and switch them to VM in the end?", "When I use VM to code it would pretty lag that it usually respond for 2 seconds when I type keyboard.", "What I'm concerned about is if I switch these codes to our VM will any problems happen?", "It works so far so good on my Mac."], ["Regarding input on client side.", "When compiling the program client side, are we expected to use command line arguments (the main argc argv format) or scanf for input when we are getting input on the client side?"], ["Project Folder Structure.", "Dear Professor/TAs,According to the guideline, it seems like we are allowed to have additional header files.", "I just want to ask that if we are allowed to have additional C/C++ files.", "For example, a C file that has some common functions for servers.Thanks."], ["iperf plots not working.", "Hi,I have been running my lab 4+5 on the upgraded 20.04 ubuntu system but I still cannot generate the required graphs.I keep running into this error:"], ["Category in Extra credit section.", "for the extra credit phase while giving the input, should we ask the user for the category as well?", "or just ask for the course code and move on to querying without category?should it be like this for e.g:Please enter the course code to query:EE450 EE669 CS402CourseCode: Credits, Professor, Days, Course NameEE450: 4, Ali Zahid, Tue;Thu, Introduction to Computer NetworksEE669: 4, Jay Kuo, Mon;Wed, Multimedia Data CompressionCS402: 4, William Cheng, Mon;Wed, Operating Systems"], ["How should we handle leading/trailing spaces in the course codes?.", "For example, if the user enters ` EE450` or `EE450 ` (with a space at the start/end).", "I can think of three responses:1) Reject the input as invalid.", "In this case we would also reject `EE450 CS402 ` (with a space at the end) as invalid, etc.2) Assume that this is an extra credit request (since whitespace separates course codes when multiple courses are specified) and treat it as the user requesting all categories for EE4503) Strip any whitespace at the start/end and then process the input.Which approach should we take?"], ["didn&#39;t have grade for lab3.", "I didn't have grade for lab3 yet.", "Is there anyone else who has no grades like me?"], ["About the grader Yifei Ma.", "Are there any other students whose grader is Yifei Ma but she hasn't received any results for her recent labs and homework assignments?", "I don't know if I was missed or if she is always so slow, but I made the same mistake in my second lab assignment as I did in the first because she was so slow to give feedback and I lost a lot of unnecessary points.", "If there are students in the same situation please reply to me, thanks!"], ["Confused about TCP from Beej Example.", "I looked over the example given in Beej's guide.", "I understand that the server closes the child socket after sending \"Hello world!\"", "each time.", "I've tried modifying the code and am able to keep the socket open by moving the accept() outside of the while() loop.", "This works fine until my client code decides to Ctrl+C, then the while loop on the server side runs infinitely printing out whatever I have inside the !fork() statement.", "Is there a way to control this behavior to close the child socket and listen to a new TCP connection?"], ["How does main server know when client has closed its socket after autehntication?.", "Hello,After the client is authenticated, the main server is in an infinite loop to respond to any queries made by the client.", "However, when the client is done making its queries and closes its socket, how does the server know this?"], ["Extra Credit: the order of course info output.", "Does the order of the output matter?", "The code I have currently groups the EE courses in one batch and CS courses in a second batch.", "Then the main server appends the request results together.", "I am asking if I need to strictly follow the order of input for the output.For example, the input is EE450 CS402 EE669.Can my output be:CourseCode: Credits, Professor, Days, Course NameEE450: 4, Ali Zahid, Tue;Thu, Introduction to Computer NetworksEE669: 4, Jay Kuo, Mon;Wed, Multimedia Data CompressionCS402: 4, William Cheng, Mon;Wed, Operating Systemsinstead ofCourseCode: Credits, Professor, Days, Course NameEE450: 4, Ali Zahid, Tue;Thu, Introduction to Computer NetworksCS402: 4, William Cheng, Mon;Wed, Operating SystemsEE669: 4, Jay Kuo, Mon;Wed, Multimedia Data Compression"], ["Port number output.", "For the printout of port numbers of servers, can I use the hardcoded port numbers that I used for the sockets, or it is expected to be generated from a function like getsockname to verify the actual port number used?e.g.const char*HARDCODED_PORT_NUM = '23999';Can I do:cout << \"The main server received the result of the authentication request from ServerC using UDP over port\" << HARDCODED_PORT_NUM;instead ofactualPortNum = some getsockname code to get the port number;cout << \"The main server received the result of the authentication request from ServerC using UDP over port\" << actualPortNum;"], ["Cite Source.", "Hi Prof. Zahid and TAs,Can I cite a block of code from other sources except for Beej's Guide?Thank you."], ["When I use the browser on the virtual machine, I cannot login to the d2l.", "I just see the following page.", "I do not know why.", "How do I get the cred.txt and other essential files?", "Thank you..."], ["C&#43;&#43; weird bug for reading files.", "Dear everyone,I encountered a weird bug that I could not seem to find an answer.", "When I read a file and getline, I am getting a weird character at the end for every line, except the last line.Does anybody know why is this happening?", "I have been looking at this for many hours.Thanks in advance."], ["Wierd behaviour on EE/CS server side UDP communication.", "So for my program on first attempt the EE/CS server is able to return result to the main server and thus the client successfully.", "On second attempt the sendto part in EE/CS server return a bad address error.", "Has anyone encountered the same issue and can anyone shed some light on what may be a possible issue that I should look into.", "Specifically will it be possible that there is any problem on the main server side besides EE/CS server themselves?"], ["Server M not receiving with static port starting with &#34;24&#34;.", "For a UDP recvfrom() in server M, I am using getaddrinfo() with the proper M port number beginning with 24.", "Then I call socket(), bind(), freeaddrinfo() and recvfrom().This should follow Beej.", "However, after recvfrom() I try to print M's port number using:struct sockaddr_in* sa = (struct sockaddr_in*)&m_address;char s[INET6_ADDRSTRLEN];inet_ntop(AF_INET, &sa->sin_addr, s, INET_ADDRSTRLEN);int port_m = (int) (sa->sin_port);cout << \"IP that server M received on is \" << s << endl;cout << \"Port that server M received on is \" << port_m << endl;And the port number is not correct - whether M receives the data or not.", "Is this the proper way to print it?"], ["Assumption of client counts.", "Dear Professor/TAs,Can we assume we will only run one client at once, and there will no two clients active at the same time?Thanks."], ["TCP message from serverM to Client.", "When the client receives a message from the serverM via TCP, should that message be sent from the serverM to the same port that the original connection was made on when the client sent credentials to serverM, or does a new connection need to be made from the serverM to the client's dynamic port number?"], ["Extra Credit.", "Dear Prof. Zahid and TAs,In the part of extra credit, when I query more than one course, do serverEE window and serverCS window need to show some messages?Thank you."], ["can we submit word document for homework 4?.", "can we submit word document for homework 4?"], ["Client and Main server connection.", "Dear TAs,Recalling from previous posts, I just want to make sure again whether I understand it correctly or not:1.", "I remember that TA said the dynamically port of client is always the same throughout the process.", "Therefore, once the client is up and connected to the serverM, then the socket will not close until the program forced to exit.2.", "Additionally, if we are implementing this way, when TAs force exit the client, the TAs will not start another client right away, correct?", "If TAs want to force exit the client, and keep testing, then they will restart all other servers before starting the new client.", "Am I understanding it correct?Thanks in advance."], ["How to Prevent Creating a “Zombie” Process?.", "Each time I run the Main Server I would create a zombie process which occupies the UDP port of the Main server.", "I cannot run the server again until I manually kill the process.", "By the way, the status of the process is S rather than Z. I don't how to prevent it and will it cause grade lost?"], ["TCP cutting off message after 8 characters.", "I noticed that when sending message via TCP the if the message is over 8 characters it cuts off the any characters after the 8th character.", "(ex.", "Professor gets cut to Professo).", "Reading online it looks like this is because TCP is attempting to send the message in multiple packets.", "I haven't been able to find a way to receive multiple packets in TCP.", "Does anyone know how I could do this?", "Do I need to do a loop of some kind?This is how I am currently sending and receiving:recv_m = read(udp_socket_main,recv,sizeof(recv));\n\nrecv[recv_m] = '\\0';\n\nstring check = recv;const char *message1 = username.c_str();\n\nwrite(tcp_socket, message1, sizeof(message1));"], ["HW#4 Chapter4 P12.", "Hi to all,Does anyone know where the example forwarding table in section 4.2.2 in HW#4 is?", "I cannot find it in our textbook.Thank you!"], ["How exactly to cite(especially socket programming code).", "Since socket programming part (referencing Beej) will be very high in similarity to what he did in the book, do we need to specify each part in our code comment or writeup.", "(I think it is very hard to define what part exactly we cited as the code is in essence quite similar anyways).", "Is it fine if we just cite that in general we used Beej's listener.c/talker.c, Man pages and so on at the beginning of the file to specify that we did take reference to his work rather than going about citing many lines of code one by one."], ["About error in the output.", "By looking at this output, I see that sometimes the response that the client gets has a typo in it.", "There is a \".\"", ", when there should be a \"T\".", "Sometimes it happens, but sometimes it does not, so I do not think there is really a typo in my code.", "Could UDP possibly cause this typo?", "This whole response is sent from the serverCS and EE.", "What client does is simply printing the response.", "Should I just leave it there or what can I do about it?"], ["UDP socket of ServerM.", "For the UDP socket in ServerM, should we use the same UDP socket to send message to ServerC, ServerEE and ServerCS?Or should we close the UDP socket after finishing communications with a backend server(e.g.", "serverC), then create a new UDP socket to send message to another backend server(e.g.", "serverEE)?I think the second way makes sense.", "Because we should make sure the client UDP socket is compatible with the UDP socket of the server that we want to send message to.", "However, in Project scenario, all three backend server have the same configuration, so we can use the same UDP socket in serverM to send message.", "Which way is expected in grading?"], ["The dropbox of HW4.", "I find that the dropbox folder for HW4 hasn't been created.", "Can TA help to create the folder please?", "Thanks a lot!"], ["Concerning submission struture.", "What exactly is the usc username here supposed to mean?", "Do we just put student ID in there or if it is something elseAlso, we don't need to include cred.txt, ee.txt and cs.txt in the file?"], ["Followup of post @367.", "Dear TAs,Sorry to create a new post for follow-up of post @367 because I have not recevived any reply from that followup yet.My questions is:Regarding the client dynamic port, in the reploy of post @367, it seems like we will open a new socket every time the client communicates with main server.", ".", "Therefore, the port number will change.", "However, as long as it is a dynamic port, we should be fine, correct?", "I am asking because I saw that we need to keep the port same in previous posts.", "But in post @367, I was informed that as long as it is dynamic then it will be fine.Regarding the second question in @367, if we are required to keep the client dyanmic port the same, when I close the client and open it again without restarting the main server, my server will not respond to the new open client anymore.", "Is this ok?", "Will I get points deducted?", "But if we are allowed to create a new socket every time the client communicates, then I can definitely solve this problem.Thanks in advance."], ["What is the expected UDP socket action in serverM?.", "Which way is preferred to implement UDP socket in serverM?1.", "use the same UDP socket to send message to ServerC, ServerEE and ServerCS.", "Because all three backend server have the same configuration, so we can use the same UDP socket in serverM to send message to them.2.", "close the UDP socket after finishing communications with a backend server(e.g.", "serverC), then create a new UDP socket to send message to another backend server(e.g.", "serverEE)?", "Here, we make sure the client UDP socket is compatible with the UDP socket of the server that we want to send message to.", "(e.g.", "belongs to the same family, AF_INET or AF_INET6).Which way is expected in grading?"], ["Confirming Requirements for serverM.", "I've looked around a bit here and on the net, and it seems like we will need be blocking for both TCP and UDP in serverM.I just wanted to confirm that we will need to use select or threads or something of the sort to circumvent this.", "Was surprised to see no questions that mentioned select on the discussion board yet, so I was checking to see if I am totally mistaken with this approach or whether this was mentioned somewhere and I missed it.EDIT: for context, I have seen the use of fork in beej & the select and polling sections in there as well - simply just want to confirm."], ["extra credit part.", "Do I have to let the main server send only two requests?", "I want the serverM to parse the string and send request to department server one by one, so that I can reuse the functions that are already implemented.Letting the main server only send two request is also not good for maintaining the order.", "If the user mix cs ee courses in the input, you have no way to separate them out and output the result in the same order."], ["Client&#39;s dynamic port number.", "I'm not sure what to do with the client's dynamic port number.", "I was able to generate it, but I'm forming a connection between the client and the serverM's hardcoded port number, and exchanging TCP messages using that port.", "I'm not using the ClientPort number in any of my send/recv TCP commands.I'm not sure how I even would, isn't the connection initiated by the client to the port of the serverM?", "What's the purpose of knowing the ClientPort number?"], ["&#34;All programs should always be on once started&#34;.", "One of the requirements in the project sheet says \"All programs should always be on once started.\"", "Just double checking that the one exception to this rule is if the client fails to authenticate three times, then the client shuts down.", "Is this correct?", "Or should the program remain running but unresponsive?"], ["Make file.", "What should we put in a make file if we are not including anything from it?", "Empty?"], ["what happens to serverM if client quits.", "The question is shown in the subject field.", "My current implementation does not expect the client to quit.", "If the client quits, then serverM can throw segmentation fault, since serverM keeps calling recv.", "Should I leave it in this way?"], ["IP address for Lab5 (follow-up of @322).", "Dear TAs,I just saw post @322.", "However, in the beginning of lab 5, it mentioned that the default ip base is 10.0.0.0/8.", "Therefore, I am using 10.0.0.0/8, instead of 15.0.0.0/8.", "I believe it is totally fine, correct?Thanks."], ["At which part can we get use_id for static port.", "Dear professor and TAs,The static port num of UDP is assigned by 21000+xxx,22000+xxx...However, I could not find USC_ID in the cred_unencrypted.txt.I was wondering if we should hard-coded it in the cred.txt?", "or should we prompt user to enter it?Thank you!"], ["Miniedit Crashes When Run is Clicked.", "Hi, my miniedit program crashes when run is clicked.", "I tried sudo python3 miniedit.py but that gives an error.", "Has anyone encountered this or knows how to resolve?", "Thank you!"], ["About server txt data files when grading.", "Hi,I'm currently using statically allocated arrays of size 100 when storing the data for the back-end servers.", "I just want to make sure that this length is long enough for the grading files, or should we expect more data?", "Thanks!"], ["How to find the dynamic port number on serverM?.", "I am able to generate a dynamic port from my client side and am able to print it using:-------------------------From beej's guide ----------------------------struct sockaddr_in sin;socklen_t len = sizeof(sin);if (getsockname(sockfd, (struct sockaddr *)&sin, &len) == -1)perror(\"getsockname\");elseprintf(\"port number in use: %d\\n\", ntohs(sin.sin_port));---------------------------------------------------------------------------However, I don't know how to find this port on the serverM.", "Using the same code but putting in the child socket(new_fd instead of sockfd) I only get the static port from the serverM side (25xxx).", "Anyone know how I can access the dynamic port number?"], ["ServerM is closing when the client is closing either by ctrl&#43;c or after 3 wrong tries.", "So when the client quits, the ServerM is also quitting, but another weird thing is that the serverM loops twice more before quitting, and both of these instances the output of recv() is 0.So as a workaround I added a condition saying if the output of recv is 0, then do an accept() and wait for another client to connect.", "Does this seem like a valid solution?"], ["Message Getting Clipped.", "When I try to send a message from the CS/EE server to the Main Server, if the text is long enough it seems to be getting clipped at 32 bytes.", "I am storing response as a string variable and any time I call sizeof(response) it returns 32 bytes, even though the string is greater than 32 bytes (1 byte per letter and roughly 37 letters).Has anyone had this issue / know how to resolve it?"], ["number of UDP sockets allowed to set upat serverM.", "As I was programming the serverM, I did not notice the identical config and wrote a socket for each other server.", "However, question @373 suggested one UDP socket is sufficient.", "May I keep the three UDP socket format?"], ["Running your project on Amazon EC2 instance.", "I want to test my project on the Amazon EC2 instance.", "I have finished setting up the EC2 instance and got it running on machine by connecting to the SSH client.", "However, I am not able to run my files.", "None of the commands such as ls/cd which you expect to work on a ubuntu terminal are working.Is there any guide for the commands to use to run the files and test the project.Thank You"], ["getaddrinfo doesn&#39;t work on Ubuntu 16.", "When I try to run this code, it only print out the first line\"ServerM is up and running\"Seems like the whole block of getaddrinfo does not work at all.I'm not quite sure why."], ["message lost after returning.", "function(data){char * ret = NULL;char * data_cate = NULL;data_course = strtok(data, \",\");data_cate = strtok(NULL,\",\");ret = data_cate;printf(\"The course information has been found: The %s of %s is %s.\\n\",cate,course,data_cate);return * ret;}*ans = function(data);printf(\"test2:ans: %s\",ans);I was doing something in my pj above to get the second string after the comma.", "It supposes to return Tue;Thu.", "In the function, it does the right thing and prints the right message.", "But after returning this result back, it prints: \"test2:and:T\".", "It only shows this first letter, all the remaining parts get lost.", "I and not familiar with C and am not sure how to fix this problem.", "Can anyone help me with it?", "Thanks!"], ["Please help me to fix the problem.. Hi my program of serverM.cpp have some problem.", "It has problem below.", "But this part of code is from the Beej's book in chapter 6.1.", "It is the same with the book's code but I failed.", "Please help me.", "How can I fix it?", "!", "[image.png](https://mail.google.com/mail/u/1?ui=2&ik=5bc5389cfc&attid=0.0.1&permmsgid=msg-a:r-7631695138672826259&th=184a71dee534a0c0&view=fimg&fur=ip&sz=s0-l75-ft&attbid=ANGjdJ_W0Q4db3a_Y3hd6EDqoMtFd6gOuBiyTzgInUhh3nxxXbTbmjsjTc5XofTEUszoZml0k62Tt3KdK8kDJdjoyEk-93Bl8QRajccOWH4qbkRzH7PCatWAWmorAO8&disp=emb&realattid=ii_laucwvnd2)  \n\n!", "[image.png](https://mail.google.com/mail/u/1?ui=2&ik=5bc5389cfc&attid=0.0.2&permmsgid=msg-a:r-7631695138672826259&th=184a71dee534a0c0&view=fimg&fur=ip&sz=s0-l75-ft&attbid=ANGjdJ9AkQxY-rXH62WaQSh_4KMNxvx8Jw5saTUFDKdVMfXv9LBk2PedB3qgJm0730_0IEEMIc-8mU70imJPLMyDzJUpSci5X9ddv7SPsQzWpK5iVgw-sayhphFJo94&disp=emb&realattid=ii_laucyj4s3)\n\n!", "[image.png](https://mail.google.com/mail/u/1?ui=2&ik=5bc5389cfc&attid=0.0.3&permmsgid=msg-a:r-7631695138672826259&th=184a71dee534a0c0&view=fimg&fur=ip&sz=s0-l75-ft&attbid=ANGjdJ9hq3rchOdVQ0Bkxk7GQez0nflzP6MtLAC0KUArqc3SQwjMOyiBnFgYahRb8cUyAHwrIUYSsAhMeVXH6JCZueNywaM4GtSJVyVK7c4AalgqB8seeMu724FjZGM&disp=emb&realattid=ii_laucz6784)"], ["Project environment.", "In Ubuntu 16.04, what versions of gcc and c++ are accepted for compilation and running for the project (if written in c++)?"], ["HW4 Ch5 P5: Should we show the initial distance table entries or the final one?.", "Title"], ["Where are the questions.", "Hello,Are there any questions to be answered in lab4 like the previous ones?", "Since I only saw steps to reproduce the lab result"], ["close() sockets.", "Hello I had a question regarding behavior for closing sockets.I believe that closing the socket is intended when a network program like this concludes as per the Beej examples (and my understanding of socket best practices).", "However in this case, since we terminate the programs manually using Ctrl+C from the terminal(s), these sockets wouldn't close?", "Is this assumption correct?", "Would the only way to close the sockets in this case be to close them in the SIGINT handler or something?I read online that the OS will eventually disconnect these sockets, but I find it annoying for these sockets to remain in use and I have to wait a bit in between subsequent runs.", "Is there a simple way to reduce this time before the sockets are cleared or something of the sort?", "I feel like I have to wait upwards of 30-60 seconds in between runs of the program.Thanks and Happy Thanksgiving!"], ["serverC.", "If the username and password are valid can we just close the sockets, and not worry about creating new sockets?"], ["project grading.", "should we consider the case when we type right course code and wrong category?"], ["HW4 P15(b) longest prefix match notation.", "Hi,For P15(b)'s longest prefix match, should we use binary string notation or a.b.c.d/x notation?"], ["The test input of username and password..", "I am wondering does the the test input of username and password from command line includes spaces.", "Since @327 the encrypted usernames and passwords have spaces, the test input username and password from command line also should be regarded as valid input.", "Then what is the name rule of usernames and passwords with spaces?", "Can a username start with a space?", "Can a password end with a space?", "How many continuous spaces are allowed in a username?", "When user inputs the username or password from the command line, should we consider or ignore the spaces in the beginning and the end?", "I ask these questions because 'cin' ignores the spaces when we input in the command line.", "The restriction of rules to spaces in crucial."], ["question about input data files (ee.txt,cs.txt, cred txt).", "The input data files used when grading will be the same as those given to us, right?", "With current input files, my program works well, but I don't know whether there will be new errors if the input files change."], ["Opening iperf plots error.", "When trying to open my plots with:xdg-open throughput.pdfI get the following error message about --no-sandbox.", "Does anyone know how I can fix this?I initially opened Miniedit using:sudo python mininet/examples/miniedit.py"], ["Setting up mininet VM.", "I installed a fresh version of ubuntu and installed mininet using option 2 from here:http://mininet.org/download/#option-1-mininet-vm-installation-easy-recommendedWhen I continue the setup and log in, I get a \"mininet-vm: command not found\" error.", "What's going wrong?"], ["Installing Mininet.", "(Solved!)", "-- Remove the repo and use the command.sudo apt install mininetThank you so much for helping me!---------------------------------I follow the instructions in Lab4 in provided virtual machine(Ubuntu 20.04) and when I try to typemininet/util/install.shit reported some errors.", "For example, it cannot get the server cerificate verification.And when I try to callsudo mnit cannot find the command.Is there anyone having the same problem and how to fix that?"], ["Project Doubt.", "I have a Mac M2 machine and I built my project on VS Code and the Mac Terminal.", "My code is perfectly working on my Mac terminal but is failing on one case when I test it.", "The code I am testing on the VM is the exact same code which I have on my MAC.All other files are exactly similar.", "Idk why this is happening.", "Is there any solution or reason to this?"], ["Lab 2.mn missing.", "Hi,After opening Miniedit, I can't find the Lab2.mn file anywhere in my home directory.", "Is there a way I can download it separately?"], ["Missing throughput.pdf.", "In lab4, I cannot get the throughput pdf files afterplot_iperf.sh test_results.jsonThere are my screenshot after this command in results folder.I have no idea why there are missing pdfs.Is there any step I missed?"], ["Repo name of Mininet.", "I am running into a problem while cloning the Mininet repo.", "When I run the command to clone I get this error.remote: Support for password authentication was removed on August 13, 2021.As a solution to the above command I am using the command below but I am getting an error on the repo name.Can anyone share the exact name of the repo(casing sensitive).git clone https://<username>:<githubtoken>@github.com/<username>/<repositoryname>.git"], ["Destination is unreachable.", "Referencing @323, I'm getting the \"destination is unreachable and there is an error\" message.", "Below is the information I have available from ifconfig and the source IP address.I'm having the same problem as the referenced poster, I'm not sure what's causing the problem:"], ["Cannot Run MiniEdit.", "I cannot run the miniEdit and I cannot also find the MiniEdit on the dock.", "Here is the screenshot of the error.", "Could you tell me if there is something wrong with my Mininet or my Ubuntu?"], ["Question about Username validation.", "Can username include numbers?", "Or only lowercase alphabetical letters?"], ["Client exit and restart.", "Hi TAs,When you test our project, if you input incorrect usernames and passwords three times, the client will shut down.", "So I just would like to know if you will just restart the client or restart all five endpoints?Thank you!"], ["Issue Upgrading Ubuntu.", "When I try to run \"sudo apt-get -y upgrade\", my download and the entire virtual box application freezes.", "When I force quit and try to reload, the virtualBox cannot load and I've had to re-download the whole virtualBox.", "When I tried the command again, the issue was repeatable.", "I also found that when I tried to run \"sudo apt-get -y update\", an issue similar to @409 occurs"], ["Servers stop compiling after certain commands.", "Hello, I am writing my code on the vm and as I near the end I am having issues compiling the code together, it seems that sometimes my code does not run all the way and gets stuck on certain commands (though other times is doesn't when I change the command slightly).", "I have noticed that it is only for when I am receiving something through a udp connection, is there anything that may be causing this issue?"], ["Client’s port for struct addrinfo.", "In question @188 the instructor gave the code dealing with the struct `sockaddr_in`.", "But II followed the Beej’s code to use the struct `addrinfo` instead.", "How can I make the conversion?"], ["Readme file : The format of all the messages exchanged.", "I had a question on the e) part of the README file which is The format of all the messages exchanged.What exactly do we have to write in that part of the README file.", "And if possible is there an example or sample file on what and how to write the format."], ["Permission Deny in Plotting.", "I have downloaded the plot from github.", "When I input the plot command, it says that permission is denied."], ["Cannot install Plot command.", "I have tried nearly every method to solve the problem occurred in the last part.", "Can I use other students' computers and virtual machine to complete the lab and I am wondering if this may affect my grades."], ["About Submission Rule c.. What does the \"suffix\" means here?"], ["Special characters possible in cs.txt / ee.txt and user input?.", "I've decided to use some uncommonly used characters as separators:~ | ^ for ee.txt and cs.txt, for user authenticationBut i'm not sure if they will show up on your versions of ee.txt, cs.txt or if these will be used as input for queries / user authentication.", "If they exist in the user input or ee.txt / cs.txt it won't behave as expected.", "I was wondering if I should1.", "expect these cases and change my strategy,2.", "leave it as it is cause these won't be tested3.", "handle them with an error message."], ["Testing on Ubuntu 16.04.", "Hello,I decided to use AWS and do the project on a Ubuntu 18.04.6 VM.", "How can I test it on Ubuntu 16.04?", "AWS does not offer it."], ["Confusion on Problem 8.", "For problem 8, we are give four ranges of Destination Address.", "And the question asks to create a routing table with 5 entries.", "For each range we can create 1 entry.", "Then where does the 5th entry come from?", "Any clarification on my confusion would be greatly appreciated, Thank you."], ["Lab Late Turn in Policy.", "Is there a late turn in for the lab assignment 4?", "I finished the project and am updating the Ubuntu but is taking too long."], ["Question about the port of every servers.", "Since we cannot use dynamic port number for servers.Do we have to bind port number of every servers (serverC, serverEE and serverCS)  to socket?", "Do we need to use connect() when using UDP?In this case, what is the process of the connection via UDP?Is this process correct?ServerM: socket() -> bind() -> recvfrom()ServerC:  socket() -> connect() -> sendto()"], ["Delay of receving course information on client side.", "***UPDATE: ISSUE SOLVED***when I treid to print this course query feedback, it always had a delay for the client to receive it.", "So for example, after querying the first course, this line would be empty (empty string).", "For the second course, this line would be the result for the first query.", "For the third course, this line would be the result for the second query.", "I am sure this coursefeed back is correct when serverCS/serverEE sends to serverM, and serverM was able to receive it correctly.", "What can be a possible cause in this case?", "Thanks in advance."], ["Number of clients.", "Does serverM need to handle multiple clients."], ["query result data.", "Hello,I have problem with showing the result of the query.For the first try, the data is corrupted.", "(It seems the error occurs during serverCS to the main server) However, with same procedure repeated, it shows the result correctly.", "How can I fix this problem?"], ["Can client handle non EE/CS courses?.", "Can client immediately print \"Course not found\" if the course is not an EE or CS course?", "Or does it have to send a request to serverM and receive a response?", "Just double checking so I don't get points docked off for this."], ["Submission structure.", "When we unzip the tar.gz file with my equivalent of:tar -xvf ee450_lastname_firstname_uscusername.tar.gzthere should first be a folder with the files inside?", "I am double checking because originally I ran the tar.gz command directly over my files, so unzipping simply unpacked all the files with no folder."], ["Compress File.", "Hi TAs,When I compress my file, it will automatically generate a \".idea\" folder as the following picture shows.", "However, after I extract it, it will not show.", "Is it okay?After extracting:Thank you!"], ["makefile.", "For makefile, will you use \"make all\" to make?", "I use \"make\" and it has the same function.", "Does it work?"], ["The port number of client is 0.", "I try the code in @188, but I cannot get any other the port number except 0.", "I put this piece of code right after connect() and I just wonder why it doesn't work.But I can get the dynamic port number at ServerM, which is quite weird.Is there any reason for the problem?"], ["File naming &#34;Your Full Name as given in the class list&#34;.", "Where do we find this class list?EDIT: I wasn't completely sure about this cause my first name has 2 words in it.", "Sometimes they only include the first word.I just went with:ee450_last_firstsecond_uscusername"], ["Do addresses in P8 table need to be binary strings?.", "I just got to P13 where it asks us to write the forwarding table from P8 in a.b.c.d/x notation, but I had already done that while working out the problem.", "Do I need to redo P8 with binary string notation or can I leave all my work in a.b.c.d/x notation without losing points?", "Thanks."], ["Can We Have a Timer or Clock Displayed on the Screen in the Final Exam?.", "Some people like me do not have watches right now.", "A timer or clock would be helpful in the final.Thanks."], ["Do we assume longest prefix match is used by default?.", "Hi,Since the homework questions keep mentioning \"using longest prefix match,\" I am wondering if in the final exam this algorithm will be used only if the question states it explicitly like the homework questions do?", "Or we can assume that the longest prefix match is used by default?"], ["Problems 9 and 10 address length.", "I wanted to make sure that I understand the wording of the question, when it says \"8-bit host addresses\" is the entire destination address 8 bits, or are 8 bits used for the host id and the other 24 bits for the network?"], ["Should we also do the hw4 question mentioned in the previous email?.", "Dear professor and TAs,I was wondering that should we also do the hw4 question mentioned in the previous email?or only the question in the updated email is fine.Thank you!"], ["Chapter 4 Problem 15.", "When calculating the necessary length of each of the subnets are including the 2 addresses needed for the network address and broadcast?", "Basically do we need to add 2 to the number of addresses supported by that subnet?", "Also when I attempted this problem I ran out of IP addresses because I needed to round the amount of interfaces supported to the next power of 2 because 250 and 120 are not powers of 2.", "Is there another address block I can use, if not how do I give the subnets that did not receive blocks the necessary number of addresses."], ["Chapter 4 Problem 11.", "Is it ok to allocate a block of IP addresses to a subnet out of order?", "Like give a subnet that is not subnet #1 the first block of addresses, to avoid gaps or should I assign addresses to the subnets #1, #2, #3 in numerical order?"], ["Chapter 5 Problem 5.", "For this problem, do we follow the steps like in the discussion video from week 12 where we only insert the nodes that are neighboring z (v,x,z)?", "or do we have to include all the nodes in the table (u,v,x,y,z)?"], ["HW4 P15 - Do subnets D, E, &amp; F have entries in the Forwarding Tables?.", "I'm wondering - since subnets D, E, and F are just for the connections between the routers, do they need to get added as entries in the Forwarding Tables?"], ["HW4 P15 Non-Unique Forwarding Tables.", "Since R1 can reach E through either of the bottom 2 interfaces, does it matter which one we assign in the forwarding table?", "My understanding is that these tables can be generated differently depending on criteria, so it seems like there could be multiple possible forwarding tables right?"], ["Aggregation.", "Do we have any rules to follow to decide if two subnet mask can be aggregated or not?From the lecture, we found the longest matching bits and aggregated in that way."], ["Tutorial for IP addressing and subnetting.", "Does anyone know where can I find the tutorial for IP addressing and subnetting professor mentioned on the class?"], ["TCP Congestion.", "While plotting TCP congestion window size graph, I am confused about the following case:1. if the congestion happens for 4,5,6,7 packets, in case of cumulative ACK, retransmission happens for all 4,5,6,7 since it is cumulative ACK.But in case of single ACK, should be retransmission again happens for 4,5,6,7 or only whose ACK is lost.For final exam, which type of ACK should be assume?2.", "If the receiver window size is 4For for 1 RTT -> 1 packet sent.", "(window size is 1)For for 2 RTT -> 2, 3 packet sent.", "(window size is 2)For for 3 RTT -> 4,5,6,7 packet sent.", "(window size is 4)So for 4 RTT -> 8,9,10,11 packet sent.", "(window size is 4)Is the packet numbering correct?"], ["TCP Push Flag.", "On this slide, when the received sends the acknowledgement, they also send a payload of 2000 bytes.", "In the header though, there is no push flag the way there is when the sender sends their payloads.", "Is this deliberate?", "I expected the push flag to be on when the receiver sends their payload."], ["Count to Infinity Problem.", "I know Prof. Zahid mentioned that count-to-infinity is not going to be on the exam, but DV will be, and trying to understand count-to-infinity is making me doubt my understanding of DV.In the slide titled \"Updating Distance Vector Tables\" (slide 17) from lecture 11/10/2022, it shows that a node will compute values and then compare to their old table, so I am confused then how in count-to-infinity this comparison can lead to an increased value in the table.", "Wouldn't the node just choose to keep the lower value stored in its own old table?Concretely, why should (on slide 19) node B change it's value for X to 14 when its old value of 6 is lower?", "Shouldn't it compare its modified table to its old table as shown in the diagram on slide 17?"], ["TCP CC Sample Problems.", "Is this one way or two way Prop.", "delay?Screenshot_(61).png"], ["Hidden terminal and exposed terminal.", "Dear everyone,I remember professor saying that one can be hidden terminal and exposed terminal at the same time.", "But I could not think of an example.", "Can somebody please give me an example?Thanks a lot."], ["Subnetting.", "While subnetting, if it is mentioned to that some subnet need 8 devices, should we assume that we need 8 host address, which means we need 1 (network address) + 8 host address + 1 (broadcast address) => 10 addresses or should we just assume 8 addresses only?"], ["Doubt TCPCC Practice problem.", "I have a confusion, while solving Problem 1 (Sample Set #6).In part a, since it is given, that losses will be detected only by triple duplicate ACKs (and timeout is not mentioned).Why would the the value of cwnd1 and cwnd2 change after one RTT ?Shouldn't the value of cwnd1, cwnd2 and ss-threshold for both senders, change at the end of third RTT (when they receive their 3rd duplicate ACK) ?"], ["When a loss event happens, does TCP still send all segments at the start of the RTT?.", "For example: If looking at the plot on Lecture Slide 37, when TCP detects a timeout at t=3 RTT, does it still manage to send out the 8 segments before reducing the cwnd to 1 MSS at t=4RTT?", "(Noting that this plot is incorrect and cwnd should be 1 at 4RTT, not immediately at 3RTT)."], ["Handwritten Lecture Notes 10/25 Lecture.", "I'm looking for the lecture notes from the 10/25 lecture but the don't seem to be on D2L.", "Are they available somewhere else?"], ["Practice Problems - Hidden and exposed terminals - Case 2.", "Case 2 asks to identify the hidden and exposed terminals if B is transmitting to C. Am I right in understanding that D would be hidden to B, and that there are no exposed terminals?"], ["Practice Problems WLAN - Problem 2 - Self-learning L2 Switch.", "I'm looking for the lecture which discusses how a self-learning L2 switch forms a forwarding table, to help me solve practice problem 2 in the WLAN practice problems.", "Please advise?"], ["Discussion 10-1 Question 16.", "In this problem, it says that from D to C, all switches can see the packet, but from C to D only B3, B2, and B4 can see the packet.", "Why is this?"], ["Bellman Ford algorithm.", "Dear Everyone,I am still a little confused about how we should compute the algorithm.Take the following graph as an example:Step 1:Initialize the table.", "For each node, if a node is its neighbor, assign the cost.", "Otherwise, assign it as inifinity.Step 2: Assume we do it inalphabetical order.", "We start from A.", "We use distance vectors of B and E to update A.", "Then we move on to B, which we use distance vectors of C, E, and A to update B.", "After that, we do the same thing for C, D, and E. Then this is counted as one iteration.Step 3: Repeat step 2.Is this the procedure what we should follow?", "There are just some small questions.", "For example, is it ok to do it in alphabetical order because I believe doing in different order will result in different values.", "Additionally, I feel like the number of steps are getting larger and larger when the number of nodes goes up.", "How many nodes are we going to have in final.Thank you very much."], ["Question about Header and MTU.", "In the lecture, professor said \"The header of the frame does not get into MTU\", then why we still subtract 20 from MTU if header does not get into MTU?"], ["Confusion about Tahoe TCP congestion phase.", "From the graph, after the end of 8th RTT, the the new threshold is 6.", "At the end of 10th RTT, it sends 4 segment, which is below the new threshold.", "However, from my understanding of this graph, it reaches the new threshold at some point between 10 and 11 and it goes into the CA phrase and sends 7 segments(threshold + 1) at the end of 10th RTT.", "But shouldn't it reaches 6 at the end of 10th RTT and 7 at the end of 11th RTT?", "Please correct me if I'm wrong."], ["Maxwindow confusion.", "I am confused about the maxwindow.", "suppose we have a problem the receiver window size is given.", "we also have the information about the BW*delay for the network.", "If the question asks \" how long does it take the sender to reach a congestion window of “maximum size” \" should I take the minimum of (bw*delay, receiver window size) as the max window?"], ["Discussion 10-3, Question 1.", "For this problem, why does R1 + R2 <= 100Mbps ?", "I watched the video but it's not made clear where that logic comes from."], ["Question about Throughput in Week 14 Lecture.", "At the end of the 8th / beginning of 9th is the the throughput ( 1+2+4+8+9+10+11+12+ 1 MSS )/ 8 RTTI was just confused because when congestion occurs, there is retransmission.", "Is that 1 a retransmission?"], ["Bellman Ford algorithm Special Case.", "Assume there's a shortest path between node A and D: A - B - C - D.  Which node should be recorded as next hop node in A's routing table ?", "(B or C ?", ")Based on my understanding of the algotithrm, B is the neighbor node of A.", "So the next hop should be B.", "But i'm not sure about this anwser."], ["Solutions for HW4 and HW5.", "Where I find the solutions for HW4 and HW5.", "The website did say it would be posted by Monday."], ["LAST WEEK.", "Hey Everyone,I am not able to find the slides and the handwritten notes used by the Professor in the last 2 lectures.", "Can someone please post them?Thanks."], ["Exposed terminal.", "Dear everyone,I just want to make sure my understanding of exposed terminal is correct.Consider the situation when A sends something to B.Scenario 1:In this scenario, C is not an exposed terminal.Scenario 2:In this scenario, C is an exposed terminal.Am I understanding it correctly?Thanks in advance."], ["Optimal Address Allocation.", "Suppose that an IP address has 8 bits for network portion.", "Assume that we need to divide it into 3 subnets each of which supports 1024 hosts.", "In this case, the network portion will require $$8+2=10$$ bits and host portion also require 10 bits.", "There are still $$32-20 = 12$$ bits available.", "What is the optimal way to handle these 12 bits ?", "(should I consider the scalarbility of the host size in each subnet or the subnet size,   *if the question does not mention anything about the scalarbility*)"], ["Formula sheet typed.", "Does the formula sheet need to be hand written or can it be printed?"], ["solutions for HW4 and HW5 not found on D2L.", "I thought the solutions should be released on Monday but I didn't find it."], ["Ethernet - Time for a collision to occur..", "I want to clarify what is the time range when a collision occurs on an ethernet link.According to me time taken for a collision to occur should range between (0,tp) and time taken for a collision to be detected should be between (0,2tp).Is my understanding of the situation correct or am I missing something?"], ["VSLM Example problem question.. Hi,I saw this explanation on the sample problem VSLM:My question is: Since only 2 usable IP addresses are required in this link, why do we only steal 6 bits?", "Why not 7 bits and leave just 1 bit for the 2 addresses?Thanks!"], ["What does best-effort mean?.", "When I read the textbook, the author says *It might appear that best-effort service is a euphemism for no service at all—a network that delivered no packets to the destination would satisfy the definition of best-effort delivery service!", "* (from textbook page 310).", "It seems quite counterintuitive to me.", "I think IP and UDP provide no effort at all...", "Anyway, can we say IP, TCP, and UDP are all best-effort services because all of them meet the least requirement of such a definition?"], ["Digital Signature.", "Dear everyone,I am still confused the usage of digest.", "In the lecture, we see that we compare the digest to see if the message is changed or not.For example, Alice is sending a message to Bob.Let's say, Alice encrypted the message with her own private key.", "Bob decrypted it with Alice's public key.", "This ensures the Authenticity.", "However, from my perspective, doesn't this also ensure the integrity?", "Since we can know this message is sent by Alice, which means this is not sent by other people, doesn't this ensure the integrity at the same time?", "So why do we need to compare the digest?I don't know which part of my understanding is incorrect.", "Thank you in advance."], ["throughput in CSMA/CD and CSMA/CA.", "After I look up the discussion-9 slides, I still confused about how to caculate the throughput in CSMA/CD and CSMA/CA.For example, consider the following two case.what is the right way to caculate the throughput in CSMA/CD and CSMA/CA.", "what should we put in the denominator?", "since in  CSMA/CD, no ack.", "And in CSMA/CA,we need ack."], ["@461_f2.", "@461_f2The instructors response here confuses me..", "I'd imagine that if A is transmitting to B, then if C transmits to D, like the student asked, then C's transmission would cause a collision at B.", "It seems to make sense that C should go to sleep if it hears A transmitting to B, and therefore C is not an exposed node."], ["Hidden terminal &amp; Expose terminal Definition.", "I'm confused about the definition of thehidden node&exposed node.", "After some research, I came up with the following definitionsSuppose node A is transmitting msg to BHidden:  it's the node that locatesoutsidethe radio range ofsender(A) , and it is also able to reach the receiver node (B)Expose:  it's the node that locatesinsidethe radio range ofsender(A)(so it would senses the busy channel when A is transmitting).That node is supposed to be able to transmit to a node other than B but cannot make it due to that A is transmitting.If there's no other receivers, then this node is not exposed.Am I correct with hidden nodes and exposed nodes ?Also, am I correct with the following case ?", "(Black circle is range of A, red one is the range of C,   C locates outside the range A, while A locates inside the range of C)"], ["General Doubt - Forwarding Table.", "For problems where we are given a forwarding table (having subnet address, subnet mask and link interface) and asked to determine to which interface a give destination address will go,whats the efficient way to solve them ?Approach 1:  GIven Destination address AND all subnet masks in table and if the result is similar to corresponding subnet address in the row, select that interfaceApproach2: For the given subnet address and subnet mask, determine the range of IPs covered by them and use those ranges to determine, where a given destination IP should go"], ["Question about IP fragmentation.", "Hi Professor,I have 2 questions about TCP fragmentation.1.", "I wonder whether the size of TCP header should be counted into offset?", "Or we just consider the payload of TCP segment (original data) when deciding IP offset.2.", "Is the offset indicates the relative position in original TCP packet (include all TCP headers), or it is the relative postion of each TCP segment?", "I mean if it is the relative postion of each TCP segment, the 1st offset of each IP packet fragmented from different TCP segment is 0.Looking forward to your reply."], ["IP aggregation.", "Dear Everyone,I have a question regarding the IP aggregation.", "In the lecture, we aggregate the IP addresses by finding the last common digits, starting from the left.", "My question is that do we stop finding the last common digits when we enter the host field?", "Or it does not matter, and we just keep counting as long as they have same digits?For example, if we aggregate 200.23.16.0/24 and 200.23.16.0/8, do we stop at 8 or we keep going until they are different?Thanks."], ["TCP Congestion Graphing.", "Screenshot_2022-12-08_at_1.34.38_AM.pngIn this the graph should take one RTT to come down right?This solution was posted in Week 15 discussion problems, question 4.Thank You!"], ["Distance Vectors.", "I am wondering what is expected of us in a Distance vector problem in the final.", "It seems like keeping track of the distance vectors at each node, and showing the propagation of the changes at each iteration will take a really long time.", "If possible it would be nice to have an example problem and a full step-by-step solution showing everything that would be required on the exam.", "All the examples I could find in the discussions/lecture show only some of the steps and mention that it would be repeated until convergence, but they don't actually show the entire solution."], ["Doubt - TCP Congestion Control.", "I have a doubt related to TCPCC problem solving esp slow start phase.As i understand the size of cwnd increases whenever sender receives an ACK.So for example,During 1 RTT, say,cwnd = 4 and sender sends say seg# 1,2,3,4and 4th segment is lost.So in case of slow start phase, by the end of this RTT,if sender receives ACKs for 1,2,3 will the cwnd increase to 7 and then drop 2 ?"], ["TCP Reno.", "For TCP Reno, professor mentioned in lecture to use the approximation method for 3 duplicate ACKs situation.", "On slide 41 of the TCP charts, using the approximation method suggested for the final what would be the window size at the beginning of round 13?For the final, will we also need to apply the \"new ACK\" part of Reno's Fast Recovery?"], ["Question about answer to problem 40.", "For Problem 40 j), the congestion window is 1 at the 17th round, 2 at the 18th round, shouldn't it be 4 at the 19th round?", "Why is it 1?For k), can someone explains why does it send 21 packets at the round 22?", "I didn't get where the 21 come from?", "I would really appreciate it."], ["Doubt on the limit of host number when using NAT.", "I wonder if an organization has large amount of hosts, say about 100k, can they use NAT/PAT to share one public IP address?"], ["Question about Link Utilization and Throughput.", "Hi Professor,I wonder what is the denominator when calculating Link utilization and throughput in the final exam.", "Is itTransmission Time + RTT(2xPropagation Delay)or justRTT(2xPropagation Delay)?Looking forward to your reply."], ["Can a point-to-point connection be viewed as a broadcast domain?.", "Hi,Does a point-to-point connection has a broadcast address?", "If not, can it still be viewed as one broadcast domain?"], ["Question about TCP header and IP fragmentation.", "Hi Professor,When TCP receives a large dagagram, which is larger than MTU, will TCP split the original data into multiple TCP segments?For example, if the data is 3000 byte and MTU is 1024 byte.", "Will TCP split these data into 3 segments and add 20 byte TCP header on each of the segments?If so, should we take these 3 headers into account when calculating offset of IP packet?"], ["Multiple Choices.", "Dear Professor Ali,Should we assume all the multiple choices may have multiple correct answers?I remember it was mentioned somewhere but I could not find it.", "Thank you very much."], ["Address Aggregation practice problem.", "F11BDEFA-7F4F-45A4-87D1-55682335FBD1.pngHello Professor,How should I approach this question?After applying the subnet mask to the network address/ prefix, I cannot interpret how the network address has bits outside the subnet mask."], ["TCP congestion control.", "What do we assume when the congestion window exceeds the bandwidth-delay product?Like the current congestion window is 64 MSS, bandwidth-delay product is 50MSS.", "Now we send 64 MSS.", "Which assumption below is true?1.All 64 MSS in this RTT is lost, need to be re-transmitted.2.The first 50 MSS is transmitted successfully, only the last 14 MSS need to be re-transmitted."], ["Homework 5 - Problem 44 Part B.", "Why were 5MSS sent in the first RTT?", "Does AIMD not start at 1MSS at 1RTT?"], ["Problem 46.", "The solutions for problem 46 has an a, b, and c portion, but the textbook number 46 does not have an a, b, or c. What question is problem 46 answering?"], ["TCP threshold confusion.", "At 10RTT, when the window size = 4,As per lecture, after we receive 2ACK, window size increased to 6 and it went to congestion avoidance.Will the same thing happen if we get cumulative ACK for all 4 packet?I think, in this case window size will increase directly to 8 after it get cumulative ACK for all 4 packet, so the next window size is 8 at 11RTT?"], ["Project grades.", "Good evening, I'm wondering when we should expect to see our final project grades\n\nThanks so much"], ["Thank you.", "Dear Professor Ali and TAs,\n\nThank you very much for a wonderful course.", "Professor Ali is definitely one of the most knowledgeable professors who is good at giving lectures.", "I learnt tons of knowledge regarding the computer network which is indeed important for us software engineers.", "Just a quick question: Is it possible to see the answers for the final because there are some questions that are definitely I would really like to know what the answer is.", "For example, some multiple questions I feel like there are multiple answers but we are allowed to choose only one.", "Thanks again."], ["Project feedback.", "In my project feedback it shows thatserverEE: invalid ArgumentJust one second before my project score was quite impressive, but the next second it was dropped and showed that there was a problem with the serverEE, which was confusing.", "Could the teaching fellows explain in detail what was going on?"], ["Extra Credit.", "Dear TAs,Do the X1, X2, X3 in our grades mean extra credit?", "If so, should there be a X4, since there are 4 labs?", "I only saw three of them.Thanks."], ["Final questions.", "Dear everyone,I can’t wait for the final to come out.", "I really would like to know the answer right now!", "The questions regarding the integrity, authentication, and Confidentiality.1.", "A sender sends a message encrypted with the public key of recipient.", "Which is not provided?In my opinion, confidentiality is provided.", "Therefore, authentication and integrity are not provided.", "But we are only allowed to select one answer.", "Therefore, I am confused.2.", "A sender sends a message encrypted by his own private key.", "Which is not provided?In my opinion, authentication is provided.", "Therefore, confidentiality and integrity are not provided.", "But still, we are only allowed to choose one.Thanks."]]